[
  {
    "companyUrl": "https://www.linkedin.com/company/snapsupplements",
    "companyName": "Snap Supplements®",
    "jobTitle": "Copywriter",
    "jobLocation": "Vancouver, WA",
    "postedAt": "2023-12-18T22:33:00.000Z",
    "appliesClosedAt": "2024-06-15T22:32:48.000Z",
    "jobDescription": "Company DescriptionSnap Supplements is a dynamic and forward-thinking organization comprised of individuals dedicated to propelling our company to new heights. We specialize in health and wellness products that promote healthy lifestyles and well-being.\nRequirements:3+ years of copywriting experience for CPG/DTC companies.Full-funnel expertise in ads, scripts, landing pages, and branding.Experience in the supplements industry.Preferred local candidates.\nResponsibilities:Craft compelling and effective copy across various channels, including ads, scripts, landing pages, and branding materials.Bring creativity and innovation to the full-funnel copywriting process.Collaborate with cross-functional teams to ensure consistent messaging.\nMUST INCLUDE A PORTFOLIO OF WORK\n",
    "jobId": 3784038973,
    "workplaceType": "On-site",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/anastasia-romanovna-189298251",
    "jobPosterName": "Anastasia Romanovna",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C560BAQE-aqZoi50Aig/company-logo_400_400/0/1675100227251/snapsupplements_logo?e=1712188800&v=beta&t=ubHU_IDih_Io1rhMJpfW75vUCPrtA_ycEMCLsbU8jPg",
    "applyUrl": "https://www.linkedin.com/job-apply/3784038973",
    "viewsCount": 322,
    "companyStaffCount": 27,
    "companyDescription": "At Snap Supplements we believe optimizing your health should be simple. That’s why we’re committed to providing you with natural, high-quality supplements made with only the purest and carefully selected superfoods, botanicals, vitamins, and minerals formulated for optimal health impact and results.*\n\n",
    "jobIndustries": "",
    "jobFunctions": "",
    "remoteAllowed": false,
    "jobState": "CLOSED",
    "jobType": "Full-time",
    "timestamp": "2023-12-30T19:01:13.172Z",
    "query": "https://www.linkedin.com/jobs/view/3784038973/",
    "applicantsCount": 66,
    "experienceLevel": ""
  },
  {
    "companyUrl": "https://www.linkedin.com/company/vysystems",
    "companyName": "VySystems",
    "jobTitle": "Technical Writer",
    "jobLocation": "Corvallis, OR",
    "postedAt": "2023-12-21T19:51:10.000Z",
    "appliesClosedAt": "2024-01-20T19:51:10.000Z",
    "jobDescription": "· Applies advanced subject matter knowledge to complex business issues and is regarded as subject matter expert.\n· Designs and develops written product. Analyzes customer information requirements and product specifications for content planning.\n· Adheres to HP standards and style document and templates, style sheets, script and graphic libraries to ensure common look and feel.\n· Interfaces with cross-function areas in support of the product development team.",
    "jobId": 3789430631,
    "workplaceType": "On-site",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/vasanth-kumar-b3b816122",
    "jobPosterName": "Vasanth Kumar",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C560BAQFqNszEfh1GBw/company-logo_400_400/0/1630650918793/vy_systems_logo?e=1712188800&v=beta&t=fXfAgPjdsCehmBFxBpYJor4CkOpOV3k6ydw6u1WwJRc",
    "applyUrl": "https://www.linkedin.com/job-apply/3789430631",
    "viewsCount": 103,
    "companyStaffCount": 479,
    "companyDescription": "Vy Systems is a part of vy.ventures and is in the business of Technology consulting, Solutions, and Managed Services, providing invaluable services across many countries since 2002. We have formulated company policies and protocols based on our distinctive DNA that has evolved over two decades and strikes a good balance between IQ and EQ.\n\nOur DNA incorporates/encompasses emotional components, Key analytical talents, intellectual abilities, plain old common sense, and presence of mind to solve issues and make important business decisions.\n\nWe adopt a people-centric culture that solves problems through passionate disagreements, encourages objective debates to arrive at consensual solutions, all of which translate into stellar service, thus enabling us to walk the talk to all stakeholders. The company’s values pivot on transparency, trust, reliability, responsiveness, and a soulful manner of conducting business.\n",
    "jobIndustries": "IT Services and IT Consulting",
    "jobFunctions": "Supply Chain",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2023-12-30T19:01:19.277Z",
    "query": "https://www.linkedin.com/jobs/view/3789430631/",
    "applicantsCount": 21,
    "experienceLevel": "Associate"
  },
  {
    "companyUrl": "https://www.linkedin.com/company/wellspring-international-education",
    "companyName": "Wellspring International Education",
    "jobTitle": "Graphic Designer/Marketing Specialist – Marketing",
    "jobLocation": "Boulder, CO",
    "postedAt": "2023-12-22T18:09:22.000Z",
    "appliesClosedAt": "2024-06-19T18:08:35.000Z",
    "jobDescription": "Overview:\nWellspring Higher Education is committed to helping students succeed in a global world. We fulfill that commitment by working with students around the world who wish to further their education. We are focused on making college more accessible and cost-effective for students around the globe without compromising quality. Wellspring Higher Education is looking for a Graphic Designer/Marketing Specialist to join our fantastic, growing team. We are committed to pushing creative boundaries and delivering exceptional marketing materials that connect with students and partner universities. \nEssential Duties and Responsibilities:\nIn the role of Graphic Designer/Marketing Specialist, the candidate will… Design visually stunning and cohesive marketing materials across various platforms including print, digital, social media, and other promotional channels.Collaborate with various Wellspring Higher Education teams to develop creative concepts and strategies that align with the company's objectives and target audience.· Create and maintain brand consistency across all design elements, ensuring we align with best practices for university partners.Produce graphics, illustrations, layouts, and other visual elements for advertising campaigns, product launches, events, and presentations.Stay updated with industry trends, design tools, and marketing techniques to continuously improve the quality and effectiveness of designs.Manage multiple projects simultaneously while meeting deadlines and maintaining high-quality standards. Launch Social Media campaigns to the appropriate audience through various social media platforms. Update and maintain records within HubSpot CRM systems as needed.Other duties as may be assigned by your supervisor. Skills & Experience: \n· Excellent oral and written communication, organizational and time management skills. · Proven ability to learn quickly, work efficiently, and accurately under set deadlines.· Proven ability to work with minimal supervision and have an excellent work ethic.· Demonstrated ability to multi-task and work in a fast-paced office environment. · Demonstrated ability to work effectively with others in a team environment. · Demonstrated commitment to maintaining confidentiality.· Ability and willingness to participate in cross company projects that support the enrollment goals of the colleges. · Ability to be a team player willing to embrace the concept of continuous improvement.\nQualifications: \nEducation and Experience: Bachelor's degree in Graphic Design, Marketing, or related field.Proven experience (2 years) working as a Graphic Designer or in a similar role within a marketing team.Proficiency in graphic design software such as Adobe Creative Suite (Photoshop, Illustrator, InDesign), Sketch, etc.Strong understanding of marketing principles and branding strategies.Excellent communication and collaboration skills to work effectively in a team environment.Ability to adapt to changing priorities and thrive in a fast-paced, deadline-driven environment.Portfolio showcasing a diverse range of design projects and marketing campaigns.\nLanguage Skills: This position requires the ability to read, write, analyze, and interpret instructions, correspondence, and/or technical documents. This position also requires the ability to respond effectively to clients, employees and management and handle sensitive and/or confidential communications. This position requires a high level of skill in both oral and written communication and the ability to effectively present ideas and information. \nTechnical Skills: Proficient in Microsoft Office and Adobe Applications. Previous experience working with HubSpot.  ",
    "jobId": 3786734022,
    "workplaceType": "Hybrid",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/darby-simpson-",
    "jobPosterName": "Darby Simpson",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C560BAQFMSSQSIsTEHA/company-logo_400_400/0/1670257770602/wellspring_international_education_logo?e=1712188800&v=beta&t=AryOYjSNuuaolipGzXF81zDsLqcAwUYFY5D_S9In4CQ",
    "applyUrl": "https://www.linkedin.com/job-apply/3786734022",
    "viewsCount": 473,
    "companyStaffCount": 34,
    "companyDescription": "Wellspring International focuses on helping colleges and universities develop an international presence and promote their brands at home and abroad.  We offer enrollment services and international college fairs to help bring the world to a university campus.",
    "jobIndustries": "",
    "jobFunctions": "",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2023-12-30T19:01:25.447Z",
    "query": "https://www.linkedin.com/jobs/view/3786734022/",
    "applicantsCount": 157,
    "experienceLevel": ""
  },
  {
    "companyUrl": "https://www.linkedin.com/company/csg-talent",
    "companyName": "CSG Talent",
    "jobTitle": "Plant Layout Designer",
    "jobLocation": "Denver, CO",
    "postedAt": "2023-12-21T11:33:57.000Z",
    "appliesClosedAt": "2024-01-04T11:33:15.000Z",
    "jobDescription": "Seeking Experienced Plant Layout DesignerAre you a seasoned Plant Layout Designer with a proven track record in metals and mineral (M&M) projects? I am actively searching for a talented individual to join a team and take on a key role in shaping the initial plant layout and conceptual design phases.About the Role:As our ideal candidate, you will bring over 10 years of expertise in plant layout design, demonstrating a strong ability to collaborate with Project Managers and Process Lead Engineers. Your primary responsibilities will include leading plant layout design for scoping, prefeasibility, and feasibility studies. Additionally, you will play a crucial role in the detailed design phase, managing designers and drafters to ensure the seamless development of plant layout models.Key Responsibilities:Collaborate closely with Project Managers and Process Lead Engineers to develop comprehensive process flow sheets and integrate project design criteria into the initial plant layout model.Lead plant layout design for various study phases, providing guidance to a team of designers and drafters during detailed design projects.Actively participate in site investigations, project launches, and model review meetings, offering valuable insights for layout optimization, cost reduction, safety enhancements, and operability considerations.Serve as a subject expert and technical resource for plant layout, offering mentorship and training to junior designers and drafters.Conduct thorough reviews of project models, providing insightful comments to the Project Manager, and ensuring the quality and compliance of CAD models, GA drawings, and flow sheets.Assist in the preparation of plant layout-related content for proposals and presentations.Engage with clients to establish basic design criteria and contribute to defining the scope of engineering services.Qualifications:A university or technical college graduate with a minimum of 10 years of relevant knowledge and training.Proficiency in computer applications for engineering is a must.Working Conditions:Adhere to an 8-hour per day core hours schedule, with occasional overtime required.\nTravel Requirements:Willingness to undertake occasional domestic and international travel, including assignments in various climates and altitudes for up to approximately 3 months at a time.\nIf you are passionate about contributing your expertise to M&M projects, ensuring efficient plant layouts that align with client expectations and industry best practices, we encourage you to connect with us. We look forward to welcoming a dedicated Plant Layout Designer to our dynamic team.",
    "jobId": 3789289421,
    "workplaceType": "On-site",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/lisettepriestley",
    "jobPosterName": "Lisette Priestley",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C4E0BAQHFlhWiEHNYDg/company-logo_400_400/0/1657104469277/csg_talent_logo?e=1712188800&v=beta&t=Fnz9TZ0iBj83aPGDGF_EaB3wOMrpTbtM3DCWjo9KA84",
    "applyUrl": "",
    "viewsCount": 108,
    "companyStaffCount": 224,
    "companyDescription": "CSG are the Global Talent Experts.\n\nCSG are Global Talent Experts operating from eight international offices across 28 niche industries within Renewable Energy, Mining Minerals and Metals, Industrial Engineering, Consumer, Infrastructure and Construction, Health Sciences, Professional Services, Natural Resources and Technology.\nWe take a pro-active approach to executive search and headhunting, placing senior-level executives and C-Suite candidates in over 60 countries worldwide. Our unparalleled recruitment success comes down to our team of highly knowledgeable, specialist consultants and vast global networks, combined with our dedication to building long-term relationships with both clients and candidates.\n\nCSG’s vision is to be the first and continuous choice when managing both our clients’ global talent needs and our candidates’ long-term careers. From our proactive executive searches to our Talent Strategy Services, we see ourselves as your talent partners, and that ethos is reflected in everything we do.\n\nWhether you are a senior level candidate looking for a step up in your career or an organisation needing help in sourcing the highest-calibre talent, don’t hesitate to get in touch. With our unparalleled global network, we can find the right fit for you.",
    "jobIndustries": "Mining",
    "jobFunctions": "Other",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2023-12-30T19:01:31.535Z",
    "query": "https://www.linkedin.com/jobs/view/3789289421/",
    "applicantsCount": 16,
    "experienceLevel": "Entry level"
  },
  {
    "companyUrl": "https://www.linkedin.com/company/first-advantage",
    "companyName": "First Advantage",
    "jobTitle": "Graphic Designer- Specialist",
    "jobLocation": "United States",
    "postedAt": "2023-12-21T02:17:07.000Z",
    "appliesClosedAt": "2024-01-20T02:17:07.000Z",
    "jobDescription": "A key member of the marketing team, the Graphic Design Specialist is responsible for conceptualizing and creating visually appealing designs to further the First Advantage brand. In addition to design activities to support the brand, this role also supports sales enablement, including (but not limited to) proposals and presentations. The Graphic Design Specialist will be key in translating complex ideas into compelling visual narratives, regularly collaborating cross-functionally with product, sales, customer success, global marketing, and other teams to support the business.\n\nDevelop engaging visual content for various mediums, including (but not limited to) sales collateral, product materials, content marketing, social media, video/motion design, email marketing, and web. Create and maintain consistent branding across all design elements. Collaborate cross-functionally to understand design needs and objectives.Design visually impactful presentations that effectively communicate complex information. Collaborate with subject matter experts to enhance presentations' visual appeal and clarity. Develop and maintain a library of templates and design assets for efficient and cohesive presentations.Work closely with sales and customer success teams to transform concepts into visually compelling proposal graphics. Design proposal layouts and contribute to the overall presentation aesthetics. Ensure that visual elements align with the messaging and goals of each proposal.\n\nOther Knowledge, Skills, Abilities, or Certifications that will be considered:\n\n Graphic Design Visual Branding Project Management Adobe Creative Suite (Photoshop, Illustrator, InDesign) Microsoft Office (PowerPoint, Word) Versatility in Design Skills – Layout, Brand Design, Digital Design, Web etc. Willingness to learn the following: Canva, Bitable, PandaDoc, and HubSpot Landing Pages Bonus: Video Editing or Motion Graphics Software (Final Cut, Adobe Premier, Adobe After Effects, etc.) Bonus: Front-end web design/coding, HTML/CSS\n\nUnited States Equal Opportunity Employment:\n\nFirst Advantage is proud to be a global leader in removing barriers and supporting our community members to ensure the changing demographics of the workforce are reflected in our hiring and employment practices. We value all of our candidates, employees, and clients, and place great emphasis on hiring and supporting qualified individuals in each role. We are an equal opportunity employer. We do not discriminate on the basis of race, color, ethnicity, ancestry, religion, sex, national origin, sexual orientation, age, citizenship status, marital status, disability, gender identity, gender expression, veteran status, genetic information, or any other area protected by applicable law.",
    "jobId": 3790975439,
    "workplaceType": "Remote",
    "jobPosterProfileUrl": "",
    "jobPosterName": "",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C4E0BAQFmtHoNdaCUjw/company-logo_400_400/0/1641999927007/first_advantage_logo?e=1712188800&v=beta&t=WfCvAqU4W28rhCmwaHC0MNPjLRnKdTj2t2IxptbU9w4",
    "applyUrl": "https://www.linkedin.com/job-apply/3790975439",
    "viewsCount": 3979,
    "companyStaffCount": 3837,
    "companyDescription": "First Advantage (Nasdaq: FA) delivers comprehensive background check solutions and insights that enable employers and housing providers to make confident choices, reduce risk, and maintain compliance.  \n\nWith offices in 29 locations and a staff of 6,400+ employees, First Advantage leverages leading technology and the industry’s largest global capabilities to complete background checks in 200+ countries and territories. If you’re looking for employee or tenant background check solutions that enable fast and reliable decision making, we’re your First Advantage. For more detailed information on First Advantage products and services, visit fadv.com. \n\nJoin Our Team! \nAt First Advantage, people are at the heart of everything we do. From our customers and partners to our greatest asset — our team members. Operating with empathy and compassion, First Advantage fosters a global inclusive workforce devoted to the diverse voices that make up our talent and products. Our team members empower each other to be their authentic selves and treat all with respect, integrity, and fairness. \n\nSay hello to a rewarding career and come join a leading provider of mission-critical background screening solutions to some of the most recognized Fortune 100 and Global 500 brands. Explore career opportunities at fadv.com/careers/ \n",
    "jobIndustries": "IT Services and IT Consulting",
    "jobFunctions": "Design, Art/Creative, Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2023-12-30T19:01:37.704Z",
    "query": "https://www.linkedin.com/jobs/view/3790975439/",
    "applicantsCount": 1376,
    "experienceLevel": "Entry level"
  },
  {
    "companyUrl": "https://www.linkedin.com/company/steneral-consulting",
    "companyName": "Steneral Consulting",
    "jobTitle": "Senior Graphic Designer & Program Facilitator",
    "jobLocation": "United States",
    "postedAt": "2023-10-09T19:44:50.000Z",
    "appliesClosedAt": "2024-04-06T19:44:51.000Z",
    "jobDescription": "Title- Senior Graphic Designer & Program Facilitator\nLocation- Remote\nLinkedin must.\nJust ONE STRONG RESUME please\nThis is a MUST : 5+ years of experience creating compelling visual communications and digital content\nJD-\nClient seeks a creative Senior Graphic Designer to join the Learning and Development team. The role collaborates closely with project stakeholders to translate business programs into visual designs that enhance and clearly communicates a program visually. This role is also responsible for graphically designing our monthly Learning newsletter that captures a learner's attention and garners enthusiasm for our learning offerings.\nJob Responsibilities\nCollaborate effectively with training managers and instructional designers to visually enhance learning materials\nDevelop, design, and layout the visual design as required for online and print learning initiatives\nDesign multimedia presentations and print materials for use in workshops, events, training exercises, learning forums, and elearning\nCollaborate & coordinate on our newsletter initiative as well as deliver the communication to our audience\nAssist in developing content for communication efforts to inform and engage our learners about training offerings, training certifications, newsletters, etc.\nCreate multimedia and learning assets for learning projects including imagery, animation, simulations, instructional videos, games, and other interactive visual content\nDesign and produce campaigns, print concepts, and web pages\nRequired Skills/Experience\n5+ years of experience creating compelling visual communications and digital content\nDesired Skills/Experience\nExpert in the use of multimedia and industry standard graphics software programs such as Adobe's Creative Suiteincluding Photoshop, Illustrator, InDesign\nExperienced working within a Microsoft PC environment\nClear communication and facilitation skills for hosting virtual sessions\nProficient in delivering email communications using Constant Contact\nGood working knowledge of front-end internet technologies such as HTML and XML\nStrong attention to detail and organizational skills\nExcellent communications skills\nDetail oriented able to quickly produce high quality deliverables\nCollaborative personality, ability to work independently and in a team environment\nEducation\nBachelor's degree in Graphic Design, Multimedia Design or related discipline.",
    "jobId": 3734755446,
    "workplaceType": "Remote",
    "jobPosterProfileUrl": "",
    "jobPosterName": "",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C4D0BAQFf8Av6ocbFLg/company-logo_400_400/0/1651682510233/steneral_consulting_logo?e=1712188800&v=beta&t=E01MGvtI3Sm-hCO6otaK7gAEX5IXXCA2s_3_1qATkmM",
    "applyUrl": "https://www.linkedin.com/job-apply/3734755446",
    "viewsCount": 3086,
    "companyStaffCount": 61,
    "companyDescription": "How do you build trust? You deliver on expectations. Not for a year. Not just during boom times. But every day. For weeks. For months. For decades. That's how Steneral is built on its core values.\n\nOur Core Values:\nIntegrity: Integrity is ingrained in what we believe and more importantly what we practice. In the staffing industry it is important we properly represent both our clients and candidates. Our option requires a team that is built on integrity. At Steneral Consulting we will act with integrity and honesty in everything we do.\nQuality: In order to provide our clients with top-level quality candidates we have crafted our process. This process allows us to pre-screen candidates offering our clients access to top-level quality in their requirements.\nTeam: Unlike many other recruiting firms Steneral Consulting’s internal staff and the process have a team at its core. We work with one another to find our clients the best talent. At Steneral Consulting, we want an environment that is positive where people will enjoy working. We will operate as a team where accountability, trust, and cooperation will flourish.",
    "jobIndustries": "Software Development",
    "jobFunctions": "Design, Art/Creative, Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Contract",
    "timestamp": "2023-12-30T19:01:43.793Z",
    "query": "https://www.linkedin.com/jobs/view/3734755446/",
    "applicantsCount": 1124,
    "experienceLevel": "Mid-Senior level"
  },
  {
    "companyUrl": "https://www.linkedin.com/company/prowess",
    "companyName": "Prowess Consulting LLC",
    "jobTitle": "Freelance Graphic Designer Consultant",
    "jobLocation": "United States",
    "postedAt": "2023-11-10T00:00:00.000Z",
    "appliesClosedAt": "2026-11-10T00:00:00.000Z",
    "jobDescription": "WHO WE AREProwess is a Seattle-based technology consulting firm that specializes in helping the largest enterprise technology companies define, manage and market their technology solutions and services. We take great pride in investing the time necessary to gain a deep understanding of our customers' technology, their customers, and the stories and strategies they need to tell to be successful in the market. Our team of technology and marketing experts is immersed in the technology trends that affect our clients’ business, so we can add value at every stage of engagement to help them succeed.WHO YOU AREProwess Consulting is looking for a freelance Graphic Designer consultant with exceptional skills when it comes to leadership, collaboration, teamwork, and flexibility. We like to build relationships with freelancers and invite them back for future projects. You are someone who takes a calm, independent approach to troubleshooting while developing and sharing innovative solutions when faced with a challenge or technical glitch. This individual is someone who will thrive in a team environment and can work independently on multiple projects simultaneously.This is a contract role with variable work hours. This role can be worked remotely from anywhere in the United States however, there will need to be availability between the hours 8 AM until 5 PM Pacific. No third-party agencies, please. ***Please submit a portfolio, with work samples, within your resume to be considered for this role.***THE ROLEPresent fresh ideas that push the boundaries of what “design” is defined as.Develop brand-appropriate graphic strategies and visual identity aesthetic executions that clearly communicate brand goals.Challenge conventional process and explore alternative creative ideasResponsible for conceptualizing and creating design deliverables that fit the needs of external clients. Present concepts to the Creative Director with confidence and quickly get up to speed on subject matter.QUALIFICATIONS10+ years of digital and/or print design experience, preferably in high-tech.Strong understanding of fundamental design principles that affect typography, composition, color, use of space and hierarchy of information.Mastery in programs for advanced design development and program applications and efficiencies, which include Adobe Creative Suite and relevant software. Motion graphics a plus.A strong online portfolio showcasing your digital work is a must.Excellent teamwork, communication, analytical, and problem-solving skills.Experience defining tone and visual language to establish a cohesive brand presentation across all deliverables.Experience multi-tasking, resolving competing priorities, and meeting project deadlines and budget constraints.ADDITIONAL DETAILSB.A. degree in graphic design, interactive design, advertising, or another design-related programThe hourly rate for this role will be $50-65 per hour as a 1099 contractor or $40-55 per hour as a W2 hourly employeeProwess is an equal opportunity employer and diversity is a core value for us. We are passionate about building and sustaining an inclusive and equitable working and learning environments for all employees.For more information, please go to www.prowessconsulting.com.",
    "jobId": 3770643131,
    "workplaceType": "Remote",
    "jobPosterProfileUrl": "",
    "jobPosterName": "",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C4E0BAQETDo8GIETxWw/company-logo_400_400/0/1630607076301/prowess_logo?e=1712188800&v=beta&t=CX_gwcB6HBoYRK_h7VZtm_fvhc0h5sXBgK3dsglm6kk",
    "applyUrl": "https://www.linkedin.com/job-apply/3770643131",
    "viewsCount": 8050,
    "companyStaffCount": 93,
    "companyDescription": "Prowess Consulting is a boutique consulting firm delivering technical marketing services, IT infrastructure services, and managed services to some of the largest U.S. companies.\n\nAt Prowess, we focus on providing technical marketing services, technology solutions, and managed services to Fortune 500 companies. We make businesses stronger by delivering the right information at the right time. We are trusted by the largest organizations to deliver results through innovative and customized solutions. \n\nProwess provides services based on expertise in a wide range of IT infrastructure and Microsoft technologies. A long-time service provider to market leading global technology companies, Prowess also applies its technical expertise in a large technical content development and content management practice.\n\nFor more information, visit www.prowesscorp.com.",
    "jobIndustries": "IT Services and IT Consulting",
    "jobFunctions": "Design, Art/Creative, Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Contract",
    "timestamp": "2023-12-30T19:01:49.964Z",
    "query": "https://www.linkedin.com/jobs/view/3770643131/",
    "applicantsCount": 3252,
    "experienceLevel": "Entry level"
  },
  {
    "companyUrl": "https://www.linkedin.com/company/trispoke-managed-services-pvt-ltd",
    "companyName": "Trispoke Managed Services Pvt. Ltd.",
    "jobTitle": "Graphic Designer",
    "jobLocation": "United States",
    "postedAt": "2023-12-12T22:10:56.000Z",
    "appliesClosedAt": "2024-06-09T22:10:57.000Z",
    "jobDescription": "This position is for a graphic design student that uses continuous improvement concepts, techniques, analysis and decision tools to promote and implement changes in manufacturing and service operations. Designs visuals to promote CORE tools and supports templates to facilitate the tracking of operation metrics.\n\nPrimary Responsibilities\n\n Designs graphics to improve visual experience in our CORE Control Room and employee engagement boards. Creates visuals and standards to promote 5’S and improve office environment. Develops and improves standard templates for operational KPI metrics. Supports OPEX team in improving visualization across the site tier boards, Kanban boards and others. Identifies opportunities or implements changes, on a need basis, to improve operation process. Supports OPEX team in generating with Line Balancing (Time studies, Yamazumi charts, Operator Load Cell, Process Flow and others) and Lean Manufacturing (VSM, Kaizen, Kanban, One Piece Flow, Material presentation, Visual Management) projects. Research new processes, methods, and equipment and make recommendations to achieve continuous improvement in assigned areas of the factory.\n\nBasic Qualifications\n\n Recognizes that individual goals contribute toward accomplishing team outcomes. Demonstrates the ability to follow through with work assignments and support management's policies and procedures. Is able to provide the status of work assignments at any time and can quickly produce any documentation or information that is needed. Uses various software packages to maintain and update documents and records. Displays a compassionate attitude toward the needs of others. Maintains a daily to-do list which helps to prioritize schedule. Must be a United States citizen. Standing for long periods of time, use of safety glasses are required, observing and documenting work procedures in order to design safety signs.\n\nPreferred Qualifications\n\n Graphic design background Microsoft Office Familiar with PDF Photoshop Familiar with InDesign",
    "jobId": 3783153116,
    "workplaceType": "Remote",
    "jobPosterProfileUrl": "",
    "jobPosterName": "",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D4D0BAQHMcQG37sozXw/company-logo_400_400/0/1695409906483/trispoke_managed_services_logo?e=1712188800&v=beta&t=fJkGvVNk3gk3Oa8MJtlelgj63qRIDu99ZE3mDMiCQvY",
    "applyUrl": "https://www.linkedin.com/job-apply/3783153116",
    "viewsCount": 3104,
    "companyStaffCount": 10,
    "companyDescription": "Established in 2022 with an Idea to provide Cost Effective, Best Quality and Tailor Made services to Clients in field of US Staffing, Recruitment, Medical Billing, Staff Augmentation, Customer Support, Virtual Assistant, Accounting and Book-Keeping. Having our State of the art contact center based out of Ahmedabad, India. We are equipped with the latest technology infrastructure to serve every client with a tailor made solution. ",
    "jobIndustries": "Aviation and Aerospace Component Manufacturing, Defense and Space Manufacturing, Armed Forces",
    "jobFunctions": "Design, Art/Creative, Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Contract",
    "timestamp": "2023-12-30T19:01:56.053Z",
    "query": "https://www.linkedin.com/jobs/view/3783153116/",
    "applicantsCount": 1195,
    "experienceLevel": "Entry level"
  },
  {
    "companyUrl": "https://www.linkedin.com/company/joinfud",
    "companyName": "Fud, Inc.",
    "jobTitle": "Side Hustle Expert - Graphic Designer",
    "jobLocation": "Portland, OR",
    "postedAt": "2023-11-06T11:31:18.000Z",
    "appliesClosedAt": "2024-05-06T09:03:28.000Z",
    "jobDescription": "We are a growing start-up company looking for a Side Hustle Expert - Graphic Designer to join our community. As a Side Hustle Expert - Graphic Designer, you will be responsible for a variety of tasks to help our community, including researching, sharing, and mentoring others to succeed with their side hustles, including how to become a freelancer and independent worker offering graphic design services.\n\nJoin the Fud community to monetize your free time and let it become your next favorite side hustle. Our community encompasses content creators, freelancers, independent workers, gig workers, resellers & thrifters, entrepreneurs, solopreneurs, and small business owners.\n\nYou can experience our community for yourself by downloading our free to use app.\n\nYou will join a community focused on side hustles, including:\n\nContent Creator — YouTube, TikTok, or InstagramReselling and Thrifting — including eBay, Etsy, Mercari, Poshmark, and othersE-Commerce — including Amazon, Shopify, and your own online storeGig Economy — like DoorDash, Uber, or LyftFreelancing and Consulting — social media marketing, graphic design, and moreOnline Business — including blogging, podcasting, and online coursesLocal Services — including cleaning, knife sharpening, notary services, pet waste removal, and moreSelf-Publishing — including Kindle Direct Publishing and Canva\n\nResponsibilities\n\nProvide one-on-one and group mentoring to side hustlersHelp side hustlers develop their side hustle ideasSet goals and track progress with side hustlersProvide support and motivation to side hustlersShare knowledge and resources with side hustlersStay up-to-date on the latest trends in side hustlesBuild relationships with side hustlers and other mentorsA willingness to share know-how through video, livestreaming, and text content\n\nRequirements\n\nYou are aware of the trends in future of work, personal finance, and entrepreneurshipAbility to work independently and manage your time effectivelyHigh level of initiative and positive approachStrong communication skillsComfortable with using social media and other digital toolsA willingness to share know-how through video, livestreaming, and text contentPassion for innovation and entrepreneurship\n\nBenefits\n\nBe your own bossLearn how to make money from your passion and interestsFind a community of like minded hard working solopreneurs and entrepreneursChoose your own schedule and work when you want\n\nWe are a community that values diversity. We encourage everyone including women and people of color to join us!",
    "jobId": 3761188010,
    "workplaceType": "Remote",
    "jobPosterProfileUrl": "",
    "jobPosterName": "",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C560BAQHnpXKE7KXmEA/company-logo_400_400/0/1634235177579/joinfud_logo?e=1712188800&v=beta&t=tJVg4LQBWFQNBcVax3GGB9ZdiIwIk1MiMeQbxnbAGzs",
    "applyUrl": "https://www.linkedin.com/job-apply/3761188010",
    "viewsCount": 3779,
    "companyStaffCount": 30,
    "companyDescription": "Fud is a mobile app that aims to super-serve the hustlers - i.e. people that have or want a side income. People come to Fud because they want to learn from experts how to start, grow or supercharge their hustle. We empower hustlers to maximize their earnings and education providing them with the fastest and easiest way to start their hustle. For creators we provide the tools that matter most for sharing know-how, simplify earnings and provide attribution to maximize creator revenue. For users we want to lay the path in front of them and remove as many barriers towards their end goal as possible. \n\nMastery matters. Community matters. Everyone's hustle journey matters. You may be just one conversation away from making it. ",
    "jobIndustries": "Technology, Information and Internet",
    "jobFunctions": "Design",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2023-12-30T19:02:02.236Z",
    "query": "https://www.linkedin.com/jobs/view/3761188010/",
    "applicantsCount": 998,
    "experienceLevel": "Entry level"
  },
  {
    "companyUrl": "https://www.linkedin.com/company/onward-search",
    "companyName": "Onward Search",
    "jobTitle": "Senior Graphic Designer",
    "jobLocation": "Portland, Oregon Metropolitan Area",
    "postedAt": "2023-12-19T17:08:56.000Z",
    "appliesClosedAt": "2024-01-18T17:08:56.000Z",
    "jobDescription": "Our retail client needs a Senior Graphic Designer to help them in shaping their brand identity, elevating visual storytelling, and contributing to the overall success of retail initiatives.\nKey Responsibilities:Lead the design and execution of visually stunning assets for various retail channels, ensuring alignment with our brand guidelines and enhancing the overall customer experience.Collaborate with cross-functional teams to understand business objectives and translate them into impactful visual solutions across print, digital, and in-store materials.Bring creativity and innovation to the table, contributing fresh ideas and design concepts that resonate with our diverse customer base.Manage the end-to-end design process, from conceptualization to final delivery, ensuring high-quality, on-brand deliverables within specified timelines.Mentor and guide junior design team members, fostering a collaborative and growth-oriented work environment.\nQualifications:Bachelor's degree in Graphic Design or related field.5+ years of professional graphic design experience, with a focus on retail design.Proficient in Adobe Creative Suite (Photoshop, Illustrator, InDesign, etc.).Strong portfolio showcasing a range of design work, including retail-related projects.Exceptional creativity, attention to detail, and the ability to balance multiple projects simultaneously.Effective communication skills with the ability to articulate and present design concepts.\nPreferred Qualifications:Experience with e-commerce design and digital marketing materials.Familiarity with motion graphics and video editing tools.Knowledge of current design trends and a keen understanding of the retail landscape.",
    "jobId": 3788142966,
    "workplaceType": "On-site",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/andyeilers",
    "jobPosterName": "Andy Eilers",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D4D0BAQH5DtQBHX9OSQ/company-logo_400_400/0/1698877723712/onward_search_logo?e=1712188800&v=beta&t=eMk-EH-pgbwVKdkejUR4JbsORyJyE_YRpNDSC83C4Nw",
    "applyUrl": "https://www.linkedin.com/job-apply/3788142966",
    "viewsCount": 405,
    "companyStaffCount": 207,
    "companyDescription": "Onward Search specializes in staffing and talent solutions at the intersection of creative and technology. We help companies hire expert talent, build scalable teams, and engage on-demand consultants.   \n\nOur passion lies in bringing the right people together to thrive in the future of work. We proudly represent a network of diverse and talented individuals. And we strive to create meaningful partnerships with clients that result in mutual success.  ",
    "jobIndustries": "Retail, Retail Apparel and Fashion",
    "jobFunctions": "Art/Creative",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Contract",
    "timestamp": "2023-12-30T19:02:08.332Z",
    "query": "https://www.linkedin.com/jobs/view/3788142966/",
    "applicantsCount": 157,
    "experienceLevel": "Mid-Senior level"
  }
]
