[
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/knowbe4",
    "companyName": "KnowBe4",
    "jobTitle": "Snr. Software Engineer (Frontend) (Remote)",
    "jobLocation": "United States",
    "postedAt": "2024-01-10T23:11:48.000Z",
    "appliesClosedAt": "2024-02-09T23:11:48.000Z",
    "jobDescription": "About KnowBe4 KnowBe4, the provider of the world's largest security awareness training and simulated phishing platform, is used by tens of thousands of organizations around the globe. KnowBe4 enables organizations to manage the ongoing problem of social engineering by helping them train employees to make smarter security decisions, every day. Fortune has ranked us as a best place to work for women, for millennials, and in technology for four years in a row! We have been certified as a \"Great Place To Work\" in 8 countries, plus we've earned numerous other prestigious awards, including Glassdoor's Best Places To Work. Our team values radical transparency, extreme ownership, and continuous professional development in a welcoming workplace that encourages all employees to be themselves. Whether working remotely or in-person, we strive to make every day fun and engaging; from team lunches to trivia competitions to local outings, there is always something exciting happening at KnowBe4. Remote positions open to the US only. This individual in this role is responsible for developing new and exciting products for KnowBe4’s customers, alongside other engineers in a fast-paced, agile development environment. Responsibilities Develops software using the KnowBe4 Software Development Lifecycle and Agile MethodologiesProvides a technical contribution to projectsDevelop and maintain high-quality, scalable, and reusable code for our front-end applications using Svelte and Typescript.Collaborate with cross-functional teams, including designers and backend developers, to ensure seamless integration and delivery of features.Rapidly prototype and refine applications based on user experience feedbackTranslate designs and wireframes into high-quality code, ensuring technical feasibility of UI/UX designs.Optimize applications for maximum speed and scalability, focusing on exceptional user experience.Application of accessibility standards (WCAG) and designing for diverse user groups.Nice to have: Interest or experience in UX design, with an understanding of user-centered design principles and practices. Minimum Qualifications Bachelor’s or Master’s degree in Computer Science, Software Engineering, or equivalent experience.4+ years of front-end development experience with a proven track record.Expertise in HTML5, CSS3, JavaScript.Strong understanding of TypescriptExperience with one or more mainstream UI frameworks (e.g., React, Angular, Vue.js, Svelte). The base pay for this position ranges from $100,000-$115,000, which will vary depending on how well an applicant's skills and experience align with the job description listed above. Our Fantastic Benefits We offer company-wide monthly bonuses, employee referral bonuses, 401k matching (US), fully paid medical insurance (US), open/generous paid time off (length varies by country), parental leave (length varies by country), adoption assistance, tuition reimbursement, certification reimbursement, certification completion bonuses, gym benefits, and a relaxed dress code - all in a modern, high-tech, and fun work environment. For more details about our benefits, visit www.knowbe4.com/careers/benefits. Note: An applicant assessment and background check may be part of your hiring procedure. Individuals seeking employment at KnowBe4 are considered without prejudice to race, color, religion, national origin, age, sex, marital status, ancestry, physical or mental disability, veteran status, gender identity, sexual orientation or any other characteristic protected under applicable federal, state, or local law. If you require reasonable accommodation in completing this application, interviewing, completing any pre-employment testing, or otherwise participating in the employee selection process, please visit www.knowbe4.com/careers/request-accommodation. No recruitment agencies, please.",
    "jobId": 3798885801,
    "workplaceType": "Remote",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C4E0BAQHogprGDd0uLw/company-logo_400_400/0/1657722218681/knowbe4_logo?e=1712793600&v=beta&t=WW8njpS5-iYHKF8VBH2MBODFizwzhJBUjaalxAxzgxM",
    "applyUrl": "https://www.linkedin.com/job-apply/3798885801",
    "experienceLevel": "Associate",
    "applicantsCount": 985,
    "viewsCount": 2230,
    "companyStaffCount": 1851,
    "companyDescription": "KnowBe4 is the provider of the world’s largest security awareness training and simulated phishing platform that helps you manage the ongoing problem of social engineering. The KnowBe4 platform is user-friendly and intuitive, and powerful. It was built to scale for busy IT pros that have 16 other fires to put out. Our goal was to design a full-featured, yet easy-to-use platform. Customers with businesses of all sizes can get the KnowBe4 platform deployed into production at least twice as fast as our competitors. Our Customer Success team gets you going in no time, without the need for consulting hours.",
    "jobIndustries": "Computer and Network Security",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:20:02.036Z",
    "query": "https://www.linkedin.com/jobs/view/3798885801/?eBP=JOB_SEARCH_ORGANIC&refId=zmuvGHLStGN4MTN9arQmLg%3D%3D&trackingId=AJB75v23Qb4hs4IEkQK1DQ%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  },
  {
    "jobPosterEmail": "kate@aim.vision",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/aim-intelligent-machines",
    "companyName": "AIM Intelligent Machines",
    "jobTitle": "Software Engineer - Robotic and Environmental Simulation",
    "jobLocation": "Greater Seattle Area",
    "postedAt": "2023-12-13T19:12:12.000Z",
    "appliesClosedAt": "2024-01-15T23:51:59.000Z",
    "jobDescription": "Software Engineer - Robotic and Environmental Simulation In this role, you will be expanding the boundaries of what’s possible in advanced robotics, leveraging simulated environments coupled with reinforcement learning. You will apply these new capabilities to terraform this planet at scale. AIM is a well-funded, mission oriented startup focused on radically scaling our civilization’s capabilities to build planetary-scale infrastructure and reverse negative effects of climate change. (https://aim.vision ) We are growing the team with motivated individuals with a passion for landing great products built with a strong engineering culture. If you find massive robots making a positive impact in the real world tantalizing, get in touch! ( https://www.aim.engineer) AIM has been built by a team of engineers, scientists, and serial entrepreneurs who previously led development of ML systems at Google, Waymo, Tesla, Apple, Google[x], Quora, Facebook and Microsoft, and are backed by General Catalyst, Human Capital, Elad Gil, Qasar Younis, Ironspring Ventures, DCVC, among other great allies. Required Qualifications: B.S. or higher degree in Computer Science, Engineering, Mathematics, Physics, or equivalent experienceMinimum of 4 years of proven experience in developing high-quality software in large codebasesStrong proficiency in C++ programmingProficiency in Unreal Engine 4 and/or 5 (UE4, UE5), including build pipelineExcellent communication skills and ability to collaborate effectively, even when working remotelyDemonstrated success working as part of a cross-functional teamExperience with Algoryx or other deformation/terrain simulationFamiliarity with sensor suite representationUnderstanding and application of simulation to real-world scenariosExperience in game development in Unreal EngineFamiliarity with fundamental concepts in physics Bonus Qualifications: 5+ years of combined graduate academic and professional software development experienceM.S. or Ph.D. in Computer Science, Engineering, Mathematics, or equivalent experienceKnowledge of AI planning, constraint satisfaction, and linear/mixed-integer programmingExperience with Unity game engineProficiency in Python programming3D modeling experienceAnimation and rigging skillsMachine learning and/or Robotics experience What we offer: Opportunity for rapid growth and have a large voice on the direction of the companyMedical, dental, vision, 401k matching & life insuranceA position with AIM is a hybrid remote and onsite flexible expectation with a strong preference for onsiteOpportunity to travel to deployment sites around the world (US, Australia & more!) AIM is an Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. AIM Intelligent Machine's General Privacy Policy: https://aim.vision/privacy/index.html",
    "jobId": 3767142065,
    "workplaceType": "Hybrid",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQE_yGAXDe1z0A/company-logo_400_400/0/1696953301522/aim_intelligent_machines_logo?e=1712793600&v=beta&t=YttfXIxyj53s6u9dqkYlrwcElUqdRz62KyrdRIl92Rs",
    "applyUrl": "https://www.linkedin.com/job-apply/3767142065",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 314,
    "viewsCount": 1115,
    "companyStaffCount": 20,
    "companyDescription": "AIM focuses on radically scaling our civilization’s capabilities to build planetary-scale infrastructure and reverse negative effects of climate change. We are growing the team with motivated individuals with a passion for landing great products built with a strong engineering culture. If you find massive robots making a positive impact in the real world tantalizing, get in touch!",
    "jobIndustries": "Software Development",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:20:08.129Z",
    "query": "https://www.linkedin.com/jobs/view/3767142065/?eBP=JOB_SEARCH_ORGANIC&refId=%2BHUwevobeBlz7y6sadfbdg%3D%3D&trackingId=sodgdstrOap%2BY9f9bS1pDQ%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/kate-sawicki-529803115",
    "jobPosterName": "Kate Sawicki"
  },
  {
    "jobPosterEmail": "tejaswari.gubbala@peopletech.com",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/people-tech-group-inc",
    "companyName": "People Tech Group Inc",
    "jobTitle": "Java Software Engineer",
    "jobLocation": "Seattle, WA",
    "postedAt": "2023-12-15T21:01:43.000Z",
    "appliesClosedAt": "2024-01-14T21:01:42.000Z",
    "jobDescription": "Title – Java Developer Job Responsibilities • Experience in Core Java and AWS, Python• Experienced in CI/CD. • Comfortable to face live coding session for interview. • Expertise in Java application, data, and infrastructure architecture disciplines. • Spring boot/ micro service coding experience. • Hands on Java application development experience. • Code reviews, Code Coverages, 3 to 5 experience of the software development• Hands on experience in java technologies – JSP, EJB, JMS, Spring, Spring Boot, Transfer Protocols – (SFTP, HTML, XML), Micro services/ Restful Services/ APIs (REST and SOAP)",
    "jobId": 3787359549,
    "workplaceType": "On-site",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQEPOko7pmrlpA/company-logo_400_400/0/1697543948515/people_tech_group_inc_logo?e=1712793600&v=beta&t=r5yGXVkwjwbkkbdmmzgqxQzQ92K-Wu2o-swijQz2Yf0",
    "applyUrl": "https://www.linkedin.com/job-apply/3787359549",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 658,
    "viewsCount": 1273,
    "companyStaffCount": 2109,
    "companyDescription": "People Tech Group is a leading Enterprise Solutions, Digital Transformation, Data Intelligence, and Modern Operation services provider. Focusing on innovative solutions and consumer satisfaction, we have assisted many small to large enterprise-class customers and Fortune 500 clients in accelerating their initiatives since our inception. We work closely with our clients to understand their business challenges and develop tailored solutions to help them succeed. As a testament to our commitment to excellence, we have acquired several companies over the years, including the Ramp Group, CodeSmart, our Government Division, and Fyrsoft, our Modern Data Center solution partner. We are dedicated to providing exceptional service and support. Contact us to learn more about how we can help your organization succeed in the digital age.",
    "jobIndustries": "Software Development",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:20:14.295Z",
    "query": "https://www.linkedin.com/jobs/view/3787359549/?eBP=CwEAAAGM-UkpWzSy6N0t7PO6uwj0mni0zMjaKGrk5f4xmczEG82vNQBg4PpyoYEtv1GgvfeQpnGHu7j6x-NvnzJEAV2R37F8ztuJGWehGsJCyMw5WLHbsQrC9n4Sr7S-afGv1Xs1bCqXipBlTfOzY135M3STtL_7C9wrtR-BeV8w9uVkKcjrCy_kOd4zXolNxohZ7cWrtWYuXO-7g6nWiuljMSBVC5yW3TzTLAHViqYb2pv2F_uyDoQ1SNiprcuOc8gFnU-cRVTzedRomdQgiZJQu8WHrHmfJrgd6G4MlmXmVO1UtAFy8rA-q0tKAAlH6BtICcecBGUfskqKz8OU_KJ-Wo79DXKngg0vlr7L70Z8bexDiIGp1mF-C0qWsZwf9OfxdXepwfc&refId=LqlLXouGyqrdJAfeDWIrRg%3D%3D&trackingId=DLqACYastfrwtK1oheYPsQ%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/tejaswari-gubbala-943951261",
    "jobPosterName": "Tejaswari Gubbala"
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/verve-industrial-protection",
    "companyName": "Verve Industrial, A Rockwell Automation Company",
    "jobTitle": "Senior Software Engineer (C#/Typescript)",
    "jobLocation": "United States",
    "postedAt": "2024-01-02T12:43:32.000Z",
    "appliesClosedAt": "2024-02-19T20:20:29.000Z",
    "jobDescription": "Verve Industrial Protection (Verve) is a high growth industrial cyber security firm focused on security and reliability of critical infrastructure. We are equally passionate about protecting our world’s infrastructure, delivering for our clients, and developing a world-class team. We operate at the cutting edge of cyber security – within the industrial control systems that control our power grid, water supply, critical manufacturing, and many other industry verticals around the world. Our industry-leading software, the Verve Security Center, paired with our unparalleled VIP Services provide a game-changing approach to an OT/IoT security program. It allows our customers to dramatically reduce the complexity of cyber protection, leverage scarce resources, and significantly increase their awareness, visibility and control of their critical OT assets, thus increasing their defenses at a much lower cost. The team responsible for the Verve Security Center software is looking to add an experienced C#/Typescript developer. What You'll Do Help drive the development of your projects from design through implementation. Work with leading open source projects like .NET Core, ElasticSearch, Docker, and more. Work directly with stakeholders to refine and breakdown product requirements.Become well versed in the OT (Operational Technology) industry as it applies to application development. What You'll Need Product-driven software development experience (typically 5+ years). History of delivering features from early ideas to finished products. Strong understanding of OOP concepts and design patterns. Ability to quickly understand. modify, and extend large, existing codebases. Working knowledge of web front end development technologies - preferably TypeScript and Angular. Strong backend programming skills in an object-oriented language such as C# or Java. Ability to independently build expertise and self-direct in related design/development. Understanding of modern software engineering practices like CI/CD and test automation. Technical leadership, ability to lead a project/feature end-to-end, and mentor junior engineers. Strong written and verbal communication suitable for internal collaboration and customer-facing documentation. Nice to Have Experience working in ASP.NET or similar. Experience leading large projects or teams to deliver features. Exposure to working with containers and containerizing existing applications (Docker, Kubernetes, Mesos). Experience with performance profiling and testing across the full stack. All qualified applicants will receive consideration for employment without regard to race, color, religion, gender, national origin, disability, or protected veteran status.",
    "jobId": 3617078370,
    "workplaceType": "Remote",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C4D0BAQHpp2aojgayNw/company-logo_400_400/0/1630580515824/verve_industrial_protection_logo?e=1712793600&v=beta&t=oBPwq74YkMOpJF-kaIMgaOfPDMpWx587IEAHWT5_91M",
    "applyUrl": "https://www.linkedin.com/job-apply/3617078370",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 958,
    "viewsCount": 2223,
    "companyStaffCount": 133,
    "companyDescription": "Verve Industrial Protection has ensured reliable and secure industrial control systems for 25 years. It's principal offering, the Verve Security Center, is a unique, vendor-agnostic OT endpoint management platform that provides IT-OT asset inventory, vulnerability management, and the ability to remediate threats and vulnerabilities from its orchestration platform. Verve’s Design-4-Defense professional services support clients in ensuring their OT environments are designed and operated in a secure manner. To learn more about Verve Industrial, visit us at www.verveindustrial.com",
    "jobIndustries": "Computer and Network Security",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:20:20.370Z",
    "query": "https://www.linkedin.com/jobs/view/3617078370/?eBP=JOB_SEARCH_ORGANIC&refId=%2BHUwevobeBlz7y6sadfbdg%3D%3D&trackingId=l3YFJ9WZ%2B3%2FyRzUC5Id2jw%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/mantl",
    "companyName": "MANTL",
    "jobTitle": "Software Engineer",
    "jobLocation": "United States",
    "postedAt": "2023-12-06T22:47:30.000Z",
    "appliesClosedAt": "2024-02-01T23:01:24.000Z",
    "jobDescription": "As a Software Engineer You Will Technically enhance the process of getting new clients to production within our Activations squad, which includes integrating with the Clients’ core provider API. Enhancing third party integrations such as, Check Book ordering, ACH Transfers, and improving product services. You will also work with the clients to discover nuances to their online account opening process and partner with our product team to account for those nuances in our system. About You You love writing clean, thoroughly documented, and well-tested code, with an eye for long term viability and performance.You measure twice and code once when writing features, placing an emphasis on error-handling, logging, and edge cases for every service you write.You enjoy the challenge of breaking down complex product asks into elegant solutions.You are comfortable with system design, and not only have architectural opinions but are comfortable writing, speaking, and advocating for them.You approach architectural challenges not with answers but with questions, and from those questions decide upon the best approach, knowing that there is no best solution, only different sets of tradeoffs to be made.You enjoy providing technical guidance, suggestions, and code reviews for your teammates, using your knowledge to raise the bar of their work as well. We Are Looking For 3+ years of professional experience writing backend services & APIsGood understanding of Computer Science fundamentals / data structures / algorithmsExperience with NodeJSWell versed with REST APIsWell versed with microservice architecturesGood technical and communication skills —- with the ability to self manage, estimate What We Offer Competitive salary ranging from $130,000 - $140,000 depending on overall experience and level.Equity100% covered medical, dental and vision insurance for employees. 50% covered medical, dental and vision insurance for families.Unlimited PTORemote set-up allowance of $400.Creative and fun team-building events (improv, chocolate and wine tasting, happy hours)Mental health and wellness programsAnd more! Who is MANTL? MANTL is a fast-growing remote based FinTech SaaS company on a mission to build technology that will help America’s financial institutions and their communities thrive. Think Shopify, but purpose-built for community banks and credit unions. Our modern banking software helps level the playing field for smaller banks and credit unions by enabling them to grow digitally. Our deposit origination platform is widely considered best-in-class in our industry, showing clear and material performance beyond any of our competitors. Check out what our CEO has to say about MANTL’s impact here. Our investors include CapitalG, Point72, ClockWork, and BoxGroup. The MANTL Culture Joining MANTL means joining an ambitious and exceptional team that solves complex problems every day. People are our most important asset and the top reason we love working at MANTL. We're a group of passionate technologists who support an accountable, transparent, and collaborative culture that fosters productive and engaging discussions. We want to work with inclusive people who understand the importance of treating their colleagues exceptionally well. We’re always a work in progress — and we’re proud to be named one of Crain’s 100 Best Places to Work in New York City for two years running. MANTL is an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation. This employer participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.",
    "jobId": 3782574739,
    "workplaceType": "Remote",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQFdxJkIulYK9g/company-logo_400_400/0/1688569813333/mantl_logo?e=1712793600&v=beta&t=Z_UkxicC-Q_yXkBi6BbXyATN6UMSQsO4crY1QEzCj8k",
    "applyUrl": "https://www.linkedin.com/job-apply/3782574739",
    "experienceLevel": "Entry level",
    "applicantsCount": 833,
    "viewsCount": 2456,
    "companyStaffCount": 107,
    "companyDescription": "MANTL is an enterprise SaaS company helping traditional financial institutions modernize and grow. Our mission is to expand access to financial services. We are tackling the biggest challenge limiting the modernization of the U.S. banking system: legacy infrastructure. Our software transforms the cost structures of banks and credit unions – empowering growth that’s up to 10x more cost-effective than building a brick-and-mortar branch. MANTL’s white-labeled account opening platform enables people to open deposit accounts on any device in roughly 2 minutes and 37 seconds. MANTL began as a challenger bank when an aha moment inspired the founders to pivot from competing to partnering with banks to deploy its technology at scale. We help community institutions raise billions of dollars in core deposits each year and are proving that they can compete online with the right set of tools. MANTL is a privately held company headquartered in New York with the backing of such prominent investors as Alphabet's CapitalG, Point72Ventures and D1 Capital Partners. We are hiring! If you are interested in joining our growing team or scheduling a demo, please visit our website: http://www.mantl.com",
    "jobIndustries": "Financial Services",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:20:26.565Z",
    "query": "https://www.linkedin.com/jobs/view/3782574739/?eBP=JOB_SEARCH_ORGANIC&refId=zmuvGHLStGN4MTN9arQmLg%3D%3D&trackingId=8d6mbCkPqOgiB2ZBes6IMQ%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/ascendion",
    "companyName": "Ascendion",
    "jobTitle": "Software Engineer",
    "jobLocation": "Redmond, WA",
    "postedAt": "2024-01-05T23:57:49.000Z",
    "appliesClosedAt": "2024-02-04T23:57:49.000Z",
    "jobDescription": "About Ascendion Ascendion is a full-service digital engineering solutions company. We make and manage software platforms and products that power growth and deliver captivating experiences to consumers and employees. Our engineering, cloud, data, experience design, and talent solution capabilities accelerate transformation and impact for enterprise clients. Headquartered in New Jersey, our workforce of 6,000+ Ascenders delivers solutions from around the globe. Ascendion is built differently to engineer the next. https://ascendion.com/Digital Engineering Services and Solutions for Enterprise TransformationDiscover Cutting-edge Digital Engineering Services and Solutions with Ascendion. Elevate your innovation journey with our expert team and unlock the true potential of technology-driven solutions for your business needs.ascendion.com We have a culture built on opportunity, inclusion, and a spirit of partnership. Come change the world with us. • Build the coolest tech for the world’s leading brands.• Solve complex problems and learn new skills.• Experience the power of transforming digital engineering for Fortune 500 clients• Master your craft with leading training programs and hands-on experience. Experience a community of changemakers! Join a culture of high-performing innovators with endless ideas and a passion for tech. Our culture is the fabric of our company, and it is what makes us unique and diverse. The way we share ideas, learning, experiences, successes, and joy allows everyone to be their best at Ascendion. About the role: Job Title: Software Engineer Key Responsibilities:Design a scalable, reliable, and optimized ML infrastructure on Azure, using best practices and industry standardsCollaborate with cross-functional teams, researchers, data scientists, and other stakeholders to comprehend their needs, gather requirements, and develop AI-powered solutions that meet their expectations and goalsProficiency with Azure Dev/Ops (ADO) tools and servicesFamiliarity with modern LLM platforms such as OpenAI, Llama, and open-source large language models (LLMs) to create innovative and impactful applications across research domainImplement platform capabilities to support MLOps for foundation models, such as continuous integration, continuous delivery, testing, monitoring, and feedbackEnsure the security and compliance of models deployed in the field, following regulatory guidelines, data privacy, and ethical considerations related to AI applicationsPrepare and maintain technical documentation, reports, and presentations to effectively communicate AI methodologies, results, and recommendations to diverse audiences Location: Redmond, WA Salary Range: The salary for this position is between $100,000 – $145,000 annually. Factors that may affect pay within this range may include geography/market, skills, education, experience, and other qualifications of the successful candidate. Benefits: The Company offers the following benefits for this position, subject to applicable eligibility requirements: [medical insurance] [dental insurance] [vision insurance] [401(k) retirement plan] [long-term disability insurance] [short-term disability insurance] [5 personal day accrued each calendar year. The Paid time off benefits meet the paid sick and safe time laws that pertains to the City/ State] [10-15 day of paid vacation time] [6 paid holidays and 1 floating holiday per calendar year] [Ascendion Learning Management System] Want to change the world? Let us know.Tell us about your experiences, education, and ambitions. Bring your knowledge, unique viewpoint, and creativity to the table. Let’s talk Let’s talk! Feel free to send your queries to harshiv.mistry@ascendion.com or simply reach out to me at 425-307-4066. Thanks,",
    "jobId": 3795184202,
    "workplaceType": "Hybrid",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C4D0BAQGHeQsU54NLQA/company-logo_400_400/0/1663258479025/ascendion_logo?e=1712793600&v=beta&t=bemWCNuplJemzOoPCrvSWGG8umA1Yol7rSckCuGXn2Q",
    "applyUrl": "https://www.linkedin.com/job-apply/3795184202",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 294,
    "viewsCount": 856,
    "companyStaffCount": 2273,
    "companyDescription": "Ascendion is an ally for enterprise digital innovation. We make and manage software platforms and products that power growth and deliver captivating experiences to consumers and employees. By embracing the future of work, we bring creativity and execution excellence together to make the digital journey valuable (and even fun)! Our engineering, cloud, data, experience design, and talent solution capabilities accelerate transformation for Global 2000 clients. Headquartered in New Jersey, our hybrid workforce delivers solutions from around the globe. Ascendion is committed to building technology that elevates life with an inclusive workforce, service to our communities, and a vibrant culture.",
    "jobIndustries": "IT Services and IT Consulting, Computer Hardware Manufacturing, Data Infrastructure and Analytics",
    "jobFunctions": "Information Technology, Other, Product Management",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:20:33.157Z",
    "query": "https://www.linkedin.com/jobs/view/3795184202/?eBP=CwEAAAGM-UkpW4M76uUg75L9FmN5VAwNHrFEYmBA0c0w_jX1qOHQOOtG6qnMClul2kdoJ0mIQAKDcyaeWfm8hgZyPkk8t2KKczuGoD_It71qnjPRg8r39FqLHCB8Jx2-UY3soeKWabKHFIRbeNGy6JYCUVHGiLyzEdl3MCTntPYmUgjNcDyLKsyNIDGPrJ9W_C_cnN2I2haR_u4yYVlWVcUL_eDZ1QwxGSJym1TKwM2BcxjSzwmrgp6pxEtGNVoe63ovfULMYu1MeqvvUezYwgNTOHGpOtOxuHJx21dc20eLyS6TmwziIX92d8IxzZqEGPcActap5l-x8Q9PCrG-mzgddkLMm1Yc9eOPG8dhR1v6KPL9pMbY0cSHz6zCDu7jZNA_HcvkVfc&refId=LqlLXouGyqrdJAfeDWIrRg%3D%3D&trackingId=sMuJ23jv4WjUJ7dxJdnzNQ%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/cypress-hcm",
    "companyName": "Cypress HCM",
    "jobTitle": "Associate Software Engineer",
    "jobLocation": "Kirkland, WA",
    "postedAt": "2023-12-14T21:14:22.000Z",
    "appliesClosedAt": "2024-01-13T21:14:21.000Z",
    "jobDescription": "Associate Software Engineer Responsibilities: This role will be focused on developing automations for ServiceNow cloud and exploring AI/ML solutions leveraging ServiceNow AI offerings.You will have the opportunity to work on ServiceNow Platform and Tools, build solutions using workflows, orchestration, and developer tools.-Experiment with the latest ServiceNow AI offerings like Virtual Agent, NLU, AI Search, Issue Auto Resolution, Task Intelligence, Document Intelligence, Generative AI and other upcoming capabilities.These capabilities may include classical Machine Learning Algorithms or Deep Learning based models like LLMs.You will design and develop cloud automations to support the ServiceNow Products in our own infrastructure.Support the team with feedback to product teams to continually improve and expand product capabilities, features, and interoperability in consideration of product needs and requirements. Qualifications: 4+ years of experience in professional software development, preferably in the Cloud Environment.Advanced programming or scripting skills (using JavaScript) and experience in object-oriented design.Experience with ServiceNow Workflows and Flow Designer tools & ServiceNow scripting (Glide JavaScript).Experience integrating software and services using common API techniques (REST, SOAP, XML, etc.)Excellent technical design, problem-solving, debugging skills and an aptitude for learning new technologies.Team player, attention to detail and ability to work well and communicate with others.Experience in driving deployments with large Enterprise companies with multiple stakeholders -- preferably AI-based products.Exposure to AI, Machine Learning will be an advantage. Compensation: $41.79 - $55.71 per hour",
    "jobId": 3781733475,
    "workplaceType": "On-site",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQH5Nvcz1NX0lw/company-logo_400_400/0/1666039707093/cypress_hcm_logo?e=1712793600&v=beta&t=vm0L9N9vtaSv-bWFWl3AXVJ_-Z5htSC6UOVlWzAYt1E",
    "applyUrl": "https://www.linkedin.com/job-apply/3781733475",
    "experienceLevel": "Associate",
    "applicantsCount": 398,
    "viewsCount": 1222,
    "companyStaffCount": 141,
    "companyDescription": "At Cypress, we deliver top talent to your doorstep. Our nationwide reach and industry expertise help us precision-match candidates, saving you time and frustration. Our experts specialize in placing highly qualified employees, ensuring a perfect fit that not only boosts individual career paths but also enhances organizational productivity.",
    "jobIndustries": "Software Development",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Contract",
    "timestamp": "2024-01-11T23:20:39.348Z",
    "query": "https://www.linkedin.com/jobs/view/3781733475/?eBP=CwEAAAGM-UkpW-Qg8XXU1aLz4D-OYcM7pSQc3wN9__wAVpqwd-6IDBr44Qe5UvN_LBxG_4po1mz0lQ9m_gI41O7OQELYbqfDztKWLUbrgVt8NeIEF0qy6pl_krQyNhRj4NqkFIBDOyyIpWOp2R7lEGCtDXlFxsUKxE-SPlw1HFAZs0eofB7NTsHmmxpsnnrD2BS16HPkm6do71eJa6lllaB5z15PSpH9zL7U7fI9blHTlHOVWUJeyIgjzqlMb6Ze1nJ0P-5S_S2g2APbMpdSTrRp6_z3mmyLu1KNkc9KiF5z6kv_uFdNabZ7tK2HLnDlTAYpMvHysePdHR7smZyZzVXMHMisqj-ew-8KqhPN6NAuUMUAJiIfVDJzDvZ92mVNJ6nGcIQU1i4&refId=LqlLXouGyqrdJAfeDWIrRg%3D%3D&trackingId=u9GeRDp6nphtGs5dzSRQGA%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  },
  {
    "jobPosterEmail": "rebecca.woloszyn@kellyservices.com",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/kelly-services",
    "companyName": "Kelly Services",
    "jobTitle": "Software Engineer",
    "jobLocation": "Seattle, WA",
    "postedAt": "2023-12-14T21:04:56.000Z",
    "appliesClosedAt": "2024-01-13T21:04:55.000Z",
    "jobDescription": "Software Engineer Kelly® Technology is seeking 5 Software Engineers for a 12 month + contract position at a Fortune 500 client in Seattle, WA. Manager needs candidates to be able to work onsite Monday-Friday. If you’re passionate about driving tomorrow’s technological innovations and are ready to take the next step in your career, trust The Experts at Hiring Experts. Salary/Pay Rate/Compensation: Negotiable based upon skill set and experience; includes full benefits through Kelly Services. Must be on our W2. Overview Our client is a cutting-edge technology company dedicated to pushing the boundaries of innovation in the field of robotics. We are seeking talented and experienced Software Engineers to join our dynamic team and contribute to the development of the next iteration of our robotic system. If you are passionate about robotics, automation, and cutting-edge software development, we invite you to be a part of our exciting journey. Responsibilities: Collaborate with cross-functional teams to plan development milestones.Design and implement software features for new workflows, operator UIs, operations data infrastructure, and dashboards.Develop software integrations with partner services.Monitor and optimize the performance of software features in our robotic fleet. Qualifications: 5+ years of non-internship professional software development experience, demonstrating proficiency in coding standards, code reviews, source control management, build processes, testing, and operations.2+ years of non-internship experience designing or architecting new and existing systems with a focus on high reliability and scalability.5+ years of programming experience with at least one modern language such as Python, Kotlin, Java, C++, or C#, with a strong emphasis on object-oriented design.Must have experience working in a R&D environment. Nice to Have:Bachelor's degree in computer science or equivalent.Experience leading teams or independently owning the delivery of features in a team environment.Robotics experience in hardware integration (e.g., hardware release cycles, heterogeneous hardware fleets), building and testing real-time or safety-critical systems, and orchestration or state machine design.AWS development experience, including Lambda functions, Athena, and infrastructure-as-code such as CDK or Terraform. What happens next:Once you apply, you’ll proceed to next steps if your skills and experience look like a good fit. But don’t worry – even if this position doesn’t work out, you’re still in the Kelly Technology network. That means our team of expert technology recruiters will have access to your profile, making your opportunities limitless.#P1",
    "jobId": 3781735060,
    "workplaceType": "On-site",
    "companyLogoUrl": "",
    "applyUrl": "https://www.linkedin.com/job-apply/3781735060",
    "experienceLevel": "Associate",
    "applicantsCount": 641,
    "viewsCount": 1732,
    "companyStaffCount": 1270,
    "companyDescription": "Kelly Services is a company based out of 1209 Venustiano Carranza, Centro Delegacional 6, Mexico.",
    "jobIndustries": "IT Services and IT Consulting, Software Development, Medical Equipment Manufacturing",
    "jobFunctions": "Quality Assurance, Information Technology",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Contract",
    "timestamp": "2024-01-11T23:20:45.435Z",
    "query": "https://www.linkedin.com/jobs/view/3781735060/?eBP=CwEAAAGM-UkpXKsNdIaZ-gqmtyJnxboDnO5AcG6fyWig-oHnVccaQ4R8YRcmUU6lF51Bej3aJ-svSoctgJnoSYdEuf_ZUUyD-txW4Amfq7NDs6iva3uRf3vwiTr4k5HInKb2l5maL98cNnlwXza079DuysJ8aGLmsPG7vIENRvTtGoOfyTWKOslleHoKs76IuuKALJ3z-EjKCssqix25mt5q9w--OTHKpOeG4gO6OpIMRD7SckAzYJMuVy2vr5yuTcXVVAIi0mEnOVEq6AXWdISIFprwn2HuyFg6wd5ZhZYUDC4tzm_KXOuKC3WYSufDqRjLpmdUxSlizCCpSMHejgkFFFz0YaASmWPM_sTsN_cYc-zxlyMNv0ukayTFOFCXLra7nm2rFJg&refId=LqlLXouGyqrdJAfeDWIrRg%3D%3D&trackingId=N4qhWWRCeafaiAJw25tzsg%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/rebeccawoloszyn",
    "jobPosterName": "Rebecca Woloszyn TSC, CSP"
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/crossover",
    "companyName": "Crossover",
    "jobTitle": "Software Engineer (AI-Powered Development), Trilogy (Remote) - $200,000/year USD",
    "jobLocation": "Seattle, WA",
    "postedAt": "2024-01-10T02:20:46.000Z",
    "appliesClosedAt": "2024-02-09T02:20:46.000Z",
    "jobDescription": "Crossover is the world's #1 source of full-time remote jobs. Our clients offer top-tier pay for top-tier talent. We're recruiting this role for our client, Trilogy. Have you got what it takes? Are you a seasoned software engineer with a deep interest in AI? Trilogy is on the lookout for exceptional engineers to lead the charge in adopting generative AI tools both in our development process and into our products. Join us to work on our exciting product portfolio: TeachTap: Bringing historical figures to life using AI, offering an engaging, TikTok-like learning experience to make learning more relevant and fun.Educational Content Generation: Utilizing the latest in generative AI combined with comprehensive learning materials to create captivating content.TeachTower: A game-based motivation system inspired by popular games like Roblox and Minecraft, designed to make learning irresistibly fun.Coachbot: A learning copilot that integrates with existing apps, guiding learning paths, recommending next steps, and rewarding daily progress.Data-driven Sales: A sales platform that leverages AI to provide real-time guidance to agents during calls, create personalized renewal plans, and quality control sales calls.Crossover: An AI-powered hiring platform that sifts through millions of applicants annually to find the top 1% of global talent. Your role will focus on integrating AI into engineering practices, using AI tools to increase efficiency and solve engineering tasks like coding and testing. Based on the obtained results, you will derive recipes and playbooks to be adopted by the broader engineering team. Maintaining high-quality standards in our codebases while ensuring high leverage of AI tools across our engineering teams will be a key part of your work. You will be an integral part of our existing engineering team, working collaboratively on our suite of products to deeply understand our environment and needs. You will have the freedom to propose and experiment with new tools and then will leverage the insights and experiences obtained to evolve our processes, advocate for new tool adoption, or even spearhead the creation of small tools, bots, and frameworks to enhance our technical setup. We seek candidates with a strong background in software engineering and a capacity for adapting to new technologies. Moreover, an interest in the latest generative AI developments and a drive for innovation are crucial. While our primary tech stack is AWS Serverless with TypeScript, we're looking for versatile engineers who can excel in a variety of technical environments and challenges. What You Will Be Doing Developing fully functional features, using AI tools to expedite delivery and enhance quality.Performing experiments with AI to enhance engineering processes, including decomposition, solution design, code generation, and troubleshooting.Documenting best practices and techniques in guides that enable others to harness the power of generative AI effectively. What You Won’t Be Doing Building new AI models from scratch; instead, your focus will be on leveraging and fine-tuning existing models to maximize efficiency.Being confined to outdated technologies; we encourage an environment that thrives on dynamic tech stacks, fostering continuous innovation. Software Engineer (AI-Powered Development) Key Responsibilities Drive transformative change by establishing a framework that seamlessly integrates generative AI, significantly amplifying engineering productivity. Basic Requirements Minimum 5 years of experience in professional software development.Minimum 3 years either as a lead engineer reviewing the work of other engineers or as an architect making important technical decisions.Excited to use and explore new generative AI tools for software engineering tasks on a day-to-day basis About Trilogy Hundreds of software businesses run on the Trilogy Business Platform. For three decades, Trilogy has been known for 3 things: Relentlessly seeking top talent, Innovating new technology, and incubating new businesses. Our technological innovation is spearheaded by a passion for simple customer-facing designs. Our incubation of new businesses ranges from entirely new moon-shot ideas to rearchitecting existing projects for today's modern cloud-based stack. Trilogy is a place where you can be surrounded with great people, be proud of doing great work, and grow your career by leaps and bounds. There is so much to cover for this exciting role, and space here is limited. Hit the Apply button if you found this interesting and want to learn more. We look forward to meeting you! Working with Crossover This is a full-time (40 hours per week), long-term position. The position is immediately available and requires entering into an independent contractor agreement with Crossover. The compensation level for this role is $100 USD/hour, which equates to $200,000 USD/year assuming 40 hours per week and 50 weeks per year. The payment period is weekly. Consult www.crossover.com/help-and-faqs for more details on this topic. What to expect next: You will receive an email with a link to start your self-paced, online job application.Our hiring platform will guide you through a series of online “screening” assessments to check for basic job fit, job-related skills, and finally a few real-world job-specific assignments. Important! If you do not receive an email from us: First, emails may take up to 15 minutes to send, refresh and check again.Second, check your spam and junk folders for an email from Crossover.com, mark as “Not Spam” since you will receive other emails as well.Third, we will send to whatever email account you indicated on the Apply form - by default, that is the email address you use as your LinkedIn username and it might be different than the one you have already checked.If all else fails, just reset your password by visiting https://www.crossover.com/auth/password-recovery if you already applied using LinkedIn EasyApply. Crossover Job Code: LJ-5106-US-Seattle-SoftwareEngine1.008",
    "jobId": 3801850892,
    "workplaceType": "Remote",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C4E0BAQG8bdX5sQ24KQ/company-logo_400_400/0/1630619679689/crossover__logo?e=1712793600&v=beta&t=_n2g2Ro4tbJ-ZZUU1K6eij07f2jxWWomjpCfssAbug8",
    "applyUrl": "https://www.linkedin.com/job-apply/3801850892",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 53,
    "viewsCount": 164,
    "companyStaffCount": 2446,
    "companyDescription": "Crossover is the world's largest database of skilled remote talent (7 million users and counting!) We help amazing professionals all over the world prove that they're just as good as anyone in Silicon Valley—𝘢𝘯𝘥 𝘥𝘦𝘴𝘦𝘳𝘷𝘦 𝘵𝘩𝘦 𝘴𝘢𝘮𝘦 𝘱𝘢𝘺𝘤𝘩𝘦𝘤𝘬. Like the Olympics, it's hard to qualify... but it's worth it! Have you got what it takes to join the 5,000+ people from 130+ countries that we've recruited for high-paying full-time remote jobs? 𝐇𝐄𝐋𝐏𝐅𝐔𝐋 𝐋𝐈𝐍𝐊𝐒: 🧑 Reviews from people we've hired: crossover.com/people-at-crossover 💼 Current openings: crossover.com/jobs 💎 Hire someone for your company: crossover.com/hire ♟️ How the process works: crossover.com/selection-process ❓ FAQs: crossover.com/help-and-faqs ~~~ 𝑵𝒐𝒕𝒆: Crossover jobs are are fully compliant with LinkedIn's policies, as well as the applicable laws in every country where we advertise. Allow us to clarify some common misconceptions: 1) The reason we post so many job ads is because LinkedIn organizes all job postings by location. So, the only way to reach candidates all over the world is to post multiple ads in every city you want to hire from. Most recruiters don't bother because it's too time consuming... but we're not most recruiters. 2) We mostly recruit independent contractors, not employees, because labor laws vary so much from one country to another that it's near-impossible to recruit globally otherwise (which is why it's still uncommon even though most jobs can now be done remotely). 3) As is standard for any self-employed person, the stated pay is the entire compensation package. Because they are not employees, each contractor is responsible for handling the things that an employer would take care of e.g. taxes, equipment, vacation time, health insurance. One of the major reasons that Crossover jobs pay so much more than local jobs is to overcompensate for these costs. It's hard, but it's worth it!",
    "jobIndustries": "IT Services and IT Consulting",
    "jobFunctions": "Engineering, Engineering, Project Management",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:20:51.614Z",
    "query": "https://www.linkedin.com/jobs/view/3801850892/?eBP=CwEAAAGM-UkpXLm-OmB67E44RjQf7W6b0wOEpoXs09IRQAbegfrc8fN_FIATzrGroP5fOE874kdzWbDsrbNN1lGk4AnwreKmwTOclhpGhJsI0Qodx5JMr2HGbzwZ8yo3DcZrKYtIe1lQFFwjmMc8vDHuShZyoAovrkgHX0d4kjp7cvptRalLcnkZs89TwFxfy2uujfKiordRUbagjjNwQ1QoMaIlOWcs_4lngETzBjbtmxtUE-5tfE3DX528jX1idWYbpY4bVMcaz-wqdSkrn4NFvQ2G_lEaalkAfu-bqtdrk9miQJbY7ts8R-GbsJ3nelEs-2l2XJDY_cedN3Q027ayhHlEuDKCtfkqev3lJOvt4eBkKC-mQVixrPkazpyq_1ceYg&refId=LqlLXouGyqrdJAfeDWIrRg%3D%3D&trackingId=so%2FTTj2q5Zc6g6m6EPfM%2FA%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/firebolt",
    "companyName": "Firebolt",
    "jobTitle": "Software Engineer, Storage",
    "jobLocation": "Kirkland, WA",
    "postedAt": "2023-12-14T11:55:58.000Z",
    "appliesClosedAt": "2024-01-13T11:55:58.000Z",
    "jobDescription": "Who We Are Firebolt is a disruptor in the cloud data warehouse space. So far we’ve built the fastest cloud data warehouse in the market, by far, and have helped some of the most data-forward companies in the world with their data challenges. But this is just the beginning. We are a strong team of world-class data experts, led by the people who built Google Big Query, Looker and Sisense. Backed by $264M in funding - we are poised to build the data platform of the future, and set a new bar for what can be done with data. About the Team The storage team owns everything related to customer data in the core Data Warehouse. From interfacing with storage infrastructure, to implementing our data loading experiences, they own this functionality front to back. The team is distributed between our offices in Kirkland, WA and Tel Aviv, and works closely with our teams in all offices (Kirkland, Tel Aviv, Munich). What You'll Do Take a key position in our R&D teamTake part in the definition of our product design and architectureDesign, build and maintain our cutting-edge database core engineDeveloping highly distributed, multithreaded, low latency core engine You should have Bachelor’s/Master’s/PhD in Computer Science, Engineering, or a related field or equivalent experience.3+ years of experience working with C++ on a production software.Fluency in modern C++ (C++11 and above, our codebase uses C++20).Experience building multi-threaded, high-performance systems.Experience building large-scale distributed systems.Experience with database internals and query processing.Experience developing for Linux. Bonus Points Familiarity with OS internals, memory management, file systemsFamiliar with cloud infra development",
    "jobId": 3784548227,
    "workplaceType": "On-site",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D4D0BAQFlYiVswppaMQ/company-logo_400_400/0/1688553506500/firebolt_logo?e=1712793600&v=beta&t=WQmpi56oLSS2DfOdwnl0QWMEC6gNBKE2LXxQPZUdQ0o",
    "applyUrl": "https://www.linkedin.com/job-apply/3784548227",
    "experienceLevel": "",
    "applicantsCount": 320,
    "viewsCount": 1214,
    "companyStaffCount": 165,
    "companyDescription": "Firebolt is the cloud data warehouse for builders of next-gen analytics experiences. Combining the benefits and ease-of-use of a modern architecture with sub-second performance at terabyte scale, Firebolt helps data engineering and dev teams deliver data applications that end-users love.",
    "jobIndustries": "Software Development",
    "jobFunctions": "Information Technology",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:20:57.705Z",
    "query": "https://www.linkedin.com/jobs/view/3784548227/?eBP=CwEAAAGM-UkpXG39AobFMX8O2ZVAINsfreUD4uvZpkJMRBeazYvT5VEHKHBhI4tx1gVVw-LHr0Lt6mDolQGhBKZUtpCteBj_kbjVfw0bqSszGORHXDAV73UQ_MjmOehPHrjNlSPA0LZRXKWPkSbuZbRG70ivNbKUS1-qdT3o7dOjj8H0HX6MtNo4eKxPbnf9-s23ICZCslisKtAyjLVbVZXyo_DZX4_sJNEIzrwe-Bi9GiEAR-h2knoik36Acy2uKPIYpF4b7ZILxFnierHj9C-W1gIlO6U-NjhIPmnZhG5FmT-DLnoztJUItHCB-o6QL2CPZaYY62CNovmcjzEYXB1QBpT9bibwk4a4ay_mlDyxrnkIO0fim_rP40ujo-1mXG0L-Xe7Rek&refId=LqlLXouGyqrdJAfeDWIrRg%3D%3D&trackingId=TmIXMwOep%2B0OioZnLh6z6g%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/aim-intelligent-machines",
    "companyName": "AIM Intelligent Machines",
    "jobTitle": "Senior Software Engineer",
    "jobLocation": "Greater Seattle Area",
    "postedAt": "2023-12-13T19:12:01.000Z",
    "appliesClosedAt": "2024-01-15T21:28:54.000Z",
    "jobDescription": "Sr. SWE Generalist C++ & pythonAutonomous stack deployed in the real world Includes Embedded devices, Advanced simulation, Physics AIM is a well-funded, mission oriented startup focused on radically scaling our civilization’s capabilities to build planetary-scale infrastructure and reverse negative effects of climate change. We are growing the team with motivated individuals with a passion for landing great products built with a strong engineering culture. If you find massive robots making a positive impact in the real world tantalizing, get in touch! (https://www.aim.engineer) We are actively seeking a seasoned and exceptionally skilled Senior Software Engineer to join our team. In this role, you will play a pivotal part in developing and maintaining C++/python codebase for our autonomous products. You will be deeply embedded with our software, simulation, and hardware engineering teams and will hold a critical role instrumental in writing high-performance, dependable code to meet the evolving needs of our clients. We are on the lookout for a self-driven individual with outstanding communication skills and a genuine passion for scalable robotics that curbs the threat of climate change. Responsibilities: Own and drive requirements and development of AIM’s software stack in an individual contributor capacity with an optional management componentEnsure smooth integration with AIM backend software stackUphold code health of production quality codebasesTake ownership of new componentsResponsible for developing and maintaining the codebase for our products and servicesYou'll be working closely with our software and hardware engineering team to create high-performance, reliable full stack solutions for our clients Qualifications: Deep expertise in and passion for designing and developing complex fullstack systemsBroad understanding of modern software engineering principlesMinimum of 5 years of experience in software engineering, with at least 3 years of experience in C++ and python production system developmentPassion for rigorous and maintainable softwareExperience with low-level computer networking protocols like TCP, UDP and streaming APIsExperience working with cloud services, databases, web APIs Bonus Qualifications: Experience with simulation technologies that capture particle physicsFamiliarity with ROS What we offer: Opportunity for rapid growth and have a large voice on the direction of the companyMedical, dental, vision, 401k matching & life insuranceA position with AIM is a hybrid with a strong preference for onsiteOpportunity to travel to deployment sites around the world (US, Australia & more!) AIM is an Equal Employment Opportunity and Affirmative Action Employers. Qualified applicants will receive consideration for employment without regard to race, religion, sex, sexual orientation, gender perception or identity, national origin, age, marital status, protected veteran status, or disability status. AIM Intelligent Machine's General Privacy Policy: https://aim.vision/privacy/index.html",
    "jobId": 3671591062,
    "workplaceType": "Hybrid",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQE_yGAXDe1z0A/company-logo_400_400/0/1696953301522/aim_intelligent_machines_logo?e=1712793600&v=beta&t=YttfXIxyj53s6u9dqkYlrwcElUqdRz62KyrdRIl92Rs",
    "applyUrl": "https://www.linkedin.com/job-apply/3671591062",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 361,
    "viewsCount": 1070,
    "companyStaffCount": 20,
    "companyDescription": "AIM focuses on radically scaling our civilization’s capabilities to build planetary-scale infrastructure and reverse negative effects of climate change. We are growing the team with motivated individuals with a passion for landing great products built with a strong engineering culture. If you find massive robots making a positive impact in the real world tantalizing, get in touch!",
    "jobIndustries": "Computer Hardware Manufacturing, Software Development, Technology, Information and Internet",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:21:03.878Z",
    "query": "https://www.linkedin.com/jobs/view/3671591062/?eBP=CwEAAAGM-UlrBzE8YJYxdw7CBbh6yMrFnjX_94K_lQVu54s5-GEcUV3g-TfVQyexj3VF7R19nSALEASWWHn11JJWyrFZXYhbqwBRLViugPSYTfExtGt0mFKrKSCxrOSFPQklp1zOHdw2cAJDouewjVfDMCamw_fppAey8xzSH5PSAjS87WOyCKhW_32QTR5F27zajOWQDJUofMsCeMql1IrJBFKPETd7Yr540L5MJO80FrdrlaftcBzh-l7poplnBoTw3Fp_3fKIkzSWskx7PqKfZiVRB5oi01UrWeexSFj5EhbU9px9W4DdU_oAUxfG4KF37yTUNFMhQXEmAx5fUJF3D7NNdded4sun5GZirp_jdxlqvBQ9NW-x32lcvrd1gvJJV36m&refId=9UrnTbJl3cXSds689sB%2BXQ%3D%3D&trackingId=mQAgtA9M3vkJ%2FBC94QJlYQ%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/kate-sawicki-529803115",
    "jobPosterName": "Kate Sawicki"
  },
  {
    "jobPosterEmail": "talha@brickredsys.com",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/brickred-systems",
    "companyName": "BrickRed Systems",
    "jobTitle": "Embedded Software Engineer - C/C++",
    "jobLocation": "Redmond, WA",
    "postedAt": "2024-01-06T04:02:59.000Z",
    "appliesClosedAt": "2024-02-05T04:02:58.000Z",
    "jobDescription": "We are looking for a Firmware Engineer who will play a crucial role in designing, developing, implementing, testing, and maintaining firmware solutions. Your primary responsibilities will include fine-tuning and improving sophisticated software implementation projects, analyzing system requirements, and creating innovative software solutions to meet client needs. You will also be involved in the enhancement of existing systems, conducting unit testing, and resolving bugs to ensure the highest quality of deliverables. Responsibilities:Fine-tune and enhance various software implementation projects.Analyze and document system requirements and develop software solutions.Implement system software, customize to client requirements, and create test data for comprehensive testing.Code new programs to client specifications and update existing programs to new standards.Prepare detailed software specifications and test plans.Create migration packages for system and user testing and oversee implementation.Conduct quality assurance reviews and post-implementation validationDevelop prototypes and Proof of Concept (PoC), implement, test, and contribute to productization.Keep abreast of industry trends and updates and incorporate relevant technologies into firmware solutions. Qualifications:Bachelor's degree in a technical field such as computer science, computer engineering, or a related field5-7 years of experience in firmware development with expertise in C, C++, and scriptingStrong foundation in computer science, with experience in Microcontrollers, UEFI, and Security protocols & solutionsExposure to Windows OS is preferred.Significant experience in large systems software design and developmentProficient in troubleshooting and unit testing for both new and legacy production systemsProven programming skills and experience in problem diagnosis and resolution About BrickRed Systems:BrickRed Systems is a global leader in next-generation technology, consulting, and business process service companies. We enable clients to navigate their digital transformation. Brickred Systems delivers a range of consulting services to our clients across multiple industries around the world. Our practices employ highly skilled and experienced individuals with a client-centric passion for innovation and delivery excellence.",
    "jobId": 3800105336,
    "workplaceType": "Hybrid",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C560BAQGpe3hjEM-dpg/company-logo_400_400/0/1630657935834/brickred_systems_logo?e=1712793600&v=beta&t=zha4bBQqK5mSbLvRpToaeMfNdcyq62dzdG9lZtGZ1ik",
    "applyUrl": "https://www.linkedin.com/job-apply/3800105336",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 119,
    "viewsCount": 356,
    "companyStaffCount": 209,
    "companyDescription": "BrickRed Systems is Microsoft Gold certified partner also one among the leading Information Technology (IT) Consulting firms of the present generation. We help Clients in achieving the best possible results, efficiency, and performance in their Business and Operations from all their investments in IT. Our services include Business Intelligence, Technology Consulting, Security Consulting, Quality Assurance, and Creative services with end-to-end consulting capabilities spanning across key industry domains. Our expertise is spread across a variety of development platforms on established and evolving technologies. BrickRed Systems operates from its strategically located offices in USA, Canada and India to ensure highest availability of our resources to the Clients on a 24x7 basis. Our onsite-offshore model for service deployment and delivery ensures greater Client engagement levels and increased Client Satisfaction. Our adherence to industry benchmarked best practices and quality standards delivers greater flexibility in business operations and increases efficiency and cost savings for our Clients.",
    "jobIndustries": "Technology, Information and Media, Software Development",
    "jobFunctions": "Information Technology, Engineering, Other",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Contract",
    "timestamp": "2024-01-11T23:21:09.955Z",
    "query": "https://www.linkedin.com/jobs/view/3800105336/?eBP=CwEAAAGM-UlrCCidXD3R13oDZA1z7zsoKphk_eR55OnZJzPxdTJdPb2QaJpz77NBzXojOEk7PTVr3CCZhEsVny6XXqZnde2SSEk9aS937NnGsZLtPxyexa53gYr-4MvWLG_2dFbWwWonddHRaTgj-OoViBrynCC6J2KMUHFrwvzTgAVaYUW__bhPlvv23ZTvhTDIajJWfoktQ2ouRDIhiGPLnq0DgG90DKz_GINETioTCAVa-K9s1Ksv7Cyvn49nBlBTP-5EcnwmpdbIJJddSA-BEbIZ325UjI5BNxazrZvoPV4L0LqIQxlHeKbS8f8ILCRSalqXaMjAvDwUYP9d-s-6YUdeow8JZtORsoXmM-s4b3aeqU5TnAkwKOdpmdpT4-OeCcxHBTU&refId=9UrnTbJl3cXSds689sB%2BXQ%3D%3D&trackingId=MetXMCRIZNCUwtDPIyeAxg%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/talha-saquib-a4307a13a",
    "jobPosterName": "Talha saquib"
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/cypress-hcm",
    "companyName": "Cypress HCM",
    "jobTitle": "Sr. Software Engineer, Windows Desktop",
    "jobLocation": "United States",
    "postedAt": "2023-10-17T15:00:55.000Z",
    "appliesClosedAt": "2024-02-10T19:24:23.000Z",
    "jobDescription": "Senior Software Engineer, Javascript dCX Application Team: The charter of the Techops Development team is to develop business applications and customizations on the ServiceNow platform. We develop easy-to-use innovative SaaS solutions for all our internal users and for our customers to interact with us. The team works on multiple complex projects simultaneously using Agile methodologies. Role: The successful candidate will work on JavaScript development across all ServiceNow products - delivering new functionality, implementing the latest features of ServiceNow and customizations as needed. What you get to do in this role: · Design and develop the best cloud software for businesses using ServiceNow platform. · Work closely with the product owners to understand detailed requirements and own your code from design, implementation, test automation and delivery of high-quality product to our users. · Collaborate day-to-day with an energetic team of like-minded developers, product managers and quality engineers using agile software development methodology. · Master new functional areas and take ownership of features that matter to our customers. · Design features with a core commitment to quality and an eye to how the products will evolve in future releases. Hiring Manager Notes: Based on the job description, what are the must have non-negotiable items that a candidate must have to be successful in this role? · JavaScript coding and debugging skills. What backgrounds/skills can we be more flexible with that can be learned on the job? · ServiceNow Platform, but highly preferred. Does this position require to sit onsite? · No, but preferred Does this person have to work in a specific time zone? (e.g. - If a person on the East Coast can work PST, is that ok?) · Looking for PST working hours, be available to take calls with India team morning (8am PST onwards) and evening (until 10/10:30pm PST) of course the whole duration will be standard working hours per day In order to be successful in this role, we need someone who has: · Bachelor or master’s degree in computer science engineering or equivalent · 5+ years working in a comparable software development role. · 3+ years of ServiceNow development experience including Service portal or AngularJS. · Expertise in coding efficient, object-oriented, and modularized software · Experience with Java and object-oriented JavaScript · Experience working with JavaScript libraries such as Angular/React JS, Bootstrap, jQuery, and Prototype · Experience working with DevOps. · Good knowledge in using ServiceNow ATF and/or Selenium · Good knowledge of AJAX, JSON, XML, SOAP, REST, and associated frameworks · Passion for software development and problem solving. · Demonstrated aptitude for learning new technologies quickly · Exceptional debugging, testing, and problem-solving skills · Strong written and verbal communication. Pay Rate Range: · $58-78.57/hr.",
    "jobId": 3733711849,
    "workplaceType": "Remote",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQH5Nvcz1NX0lw/company-logo_400_400/0/1666039707093/cypress_hcm_logo?e=1712793600&v=beta&t=vm0L9N9vtaSv-bWFWl3AXVJ_-Z5htSC6UOVlWzAYt1E",
    "applyUrl": "https://www.linkedin.com/job-apply/3733711849",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 782,
    "viewsCount": 1757,
    "companyStaffCount": 141,
    "companyDescription": "At Cypress, we deliver top talent to your doorstep. Our nationwide reach and industry expertise help us precision-match candidates, saving you time and frustration. Our experts specialize in placing highly qualified employees, ensuring a perfect fit that not only boosts individual career paths but also enhances organizational productivity.",
    "jobIndustries": "IT Services and IT Consulting",
    "jobFunctions": "Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Contract",
    "timestamp": "2024-01-11T23:21:16.104Z",
    "query": "https://www.linkedin.com/jobs/view/3733711849/?eBP=CwEAAAGM-UlrCNA1Ug7Hs0RTUOCzrsloz7kSkjw2tZf_7Biv1-AQnET5A8ss_L6oaX2YSzS_AFEeerlRmBGu8Z5EgTUnmDUAdEtPhpEgkSUtniijEEUUB-FF3bp5A3-CSLL6N37p1hMzGZ_CUCnB920qIxvWwNL4O11NghekgdQkqqdJjaZ6kUAB6H80_qJ-zbtiJM6PFf6szjBrMcXzI8WFZYMZ8rd2_TyIO2irawq2Sx_QM3wsHDQpYDfZ9UfPkhkfGUgkcDQOCe2udecA2A7bj1h2gzgGih6Hq_gqdf3okssh4TsshsOU3rSRIworQvunapED6icFejIfLGgAWuAXE4lmK1VNmEIOrnZDXnJoeMdnE7ogN92R0e5WBn7kLYfVkr9Chxw&refId=9UrnTbJl3cXSds689sB%2BXQ%3D%3D&trackingId=q0KEXqgDeI5o7iMEQKVNNw%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/burtch-works",
    "companyName": "Burtch Works",
    "jobTitle": "Software Engineer-Data Intergration",
    "jobLocation": "United States",
    "postedAt": "2023-12-21T16:16:03.000Z",
    "appliesClosedAt": "2024-12-15T12:16:16.000Z",
    "jobDescription": "**W2 REQUIRED-Sponsorship is not available** Accountable for developing and delivering technological responses to targeted business outcomes. Analyze, design and develop enterprise data and information architecture deliverables, focusing on data as an asset for the enterprise. Understand and follow reusable standards, design patterns, guidelines, and configurations to deliver valuable data and information across the enterprise, including direct collaboration with 84.51, where needed. Demonstrate the company's core values of respect, honesty, integrity, diversity, inclusion and safety. Essential Job Functions:Utilize enterprise standards for data domains and data solutions, focusing on simplified integration and streamlined operational and analytical usesEnsure there is clarity between ongoing projects, escalating when necessary, including direct collaboration with 84.51Leverage innovative new technologies and approaches to renovate, extend, and transform the existing core data assets, including SQL-based, NoSQL-based, and Cloud-based data platformsDefine high-level migration plans to address the gaps between the current and future stateContribute to the development of cost/benefit analysis for leadership to shape sound architectural decisionsAnalyze technology environments to detect critical deficiencies and recommend solutions for improvementPromote the reuse of data assets, including the management of the data catalog for referenceDraft architectural diagrams, interface specifications and other design documentsMust be able to perform the essential job functions of this position with or without reasonable accommodation Minimum Position Qualifications:Bachelor's Degree in computer science, software engineering, or related field4+ years experience in the data development and principles including end-to-end design patterns4+ years proven track record of delivering large scale, high quality operational or analytical data systems4+ years successful and applicable experience building complex data solutions that have been successfully delivered to customersAny experience in a minimum of two of the following technical disciplines: data warehousing, big data management, analytics development, data science, application programming interfaces (APIs), data integration, cloud, servers and storage, and database mgmtExcellent oral/written communication skills Desired Previous Experience/Education:Any experience with Azure Data Platform stack: Azure Data Lake, Data Factory and DatabricksAny experience with Python, Spark and SQLAny experience with streaming technologies like Kafka, IBM MQ and EventHubAny experience with data science solutions or platformsAny experience with a variety of SQL, NoSQL and Big Data PlatformsAny experience building solutions using elastic architectures (preferably Microsoft Azure and Google Cloud Platform)",
    "jobId": 3490980140,
    "workplaceType": "Remote",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQGI80kVo4t7hg/company-logo_400_400/0/1698938235961/burtch_works_logo?e=1712793600&v=beta&t=6zmRodEuH5hGwKCNSflN0Xj6Io8SFnbHmGYdELu3Jyo",
    "applyUrl": "https://www.linkedin.com/job-apply/3490980140",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 1845,
    "viewsCount": 5174,
    "companyStaffCount": 56,
    "companyDescription": "Welcome to BW (Burtch Works), where we're on a shared mission to build a world that works better for everyone. Specializing in the dynamic spheres of Data Science, AI, Machine Learning, Data Engineering, and Market Research, we're not just a recruitment agency — we're architects of the modern data and analytics landscape. At BW, our approach blends human expertise with the efficiency of our Staffing Platform, making us uniquely equipped to navigate the fast-paced world of data. Whether you're a Fortune 50 company or a growing startup, our tailored talent solutions ensure you stay ahead in the game. For job seekers, we're more than just a path to new opportunities. We take a personalized approach to understand your skills, ambitions, and career goals. Our aim? To connect you with roles that not only match your expertise but also propel your professional growth. For businesses, BW is synonymous with building cutting-edge data and analytics teams. Our consultative strategy delves deep into your unique challenges, enabling us to deliver talent solutions that are not just effective but also transformative. Our insights and market expertise have earned us accolades and recognition from Forbes and various prestigious publications. We're not just recognized experts in our field; we're pioneers shaping the future of recruitment in data and AI. Join us at BW as we continue to forge paths in this exciting technological era. Whether you're looking to advance your career or seeking the right talent to elevate your team, we're here to make it happen.",
    "jobIndustries": "Strategic Management Services",
    "jobFunctions": "Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:21:22.173Z",
    "query": "https://www.linkedin.com/jobs/view/3490980140/?eBP=CwEAAAGM-UlrCAMx-vrkSavGrThJN4hs1gk7euBqCIwzFgIS6KZCEt9U33vBh7TvoEW1hJfh9DD8bo0b8640ddRW83gGRiEErQIx1jbT2_GVdZIjh59vBZZJ76auhaXcvH-fl-YQuasngdNg8yGErTF-w5ZEReFSaeF3nupSZtKJc2VlkW5373IUdGIev9cnmC8wG95O13XYAUOFItGZu7TaVLeVx773ovfhAYUzkFIu39NxqiCE8WIMcZ5RJhRJtMjkNzCzWFQsOUZf8hf04WJmF_7egU8fRWmwraUcw3tZvcPnJ0YTyaWAMxOoknXqfrRnTLPtKzLsRc6RKS8580Yu9RFx_LLurIYweeU_aLxzDCVf5RPR21DBq477Y5QV_DkOYSI48D1I-w&refId=9UrnTbJl3cXSds689sB%2BXQ%3D%3D&trackingId=pmDUJ3biKLWcRZjQ5niNqA%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/sono-bello",
    "companyName": "Sono Bello",
    "jobTitle": "Software Engineer - .NET (Onsite)",
    "jobLocation": "Kirkland, WA",
    "postedAt": "2024-01-10T17:28:02.000Z",
    "appliesClosedAt": "2024-02-17T17:18:50.000Z",
    "jobDescription": "US – Hybrid from Kirkland office twice a week.Sono Bello views Software Engineering as more than just a profession; it is a craft, integral to our successful and rapidly growing organization. By joining us, you become a part of a team that is transforming millions of lives through body transformation. This is your opportunity to architect and build high quality web applications on the serverless Microsoft stack and React.js. You will have the freedom and flexibility to craft new technologies, best practices, and infrastructure to achieve peak software development and deployment efficiency and quality.The Software Engineer is responsible for the development and maintenance of new software and integration of our existing telephony and CRM applications and tools. Must have experience leveraging the .NET framework, Entity Framework, SQL, RESTful Services, and knowledge of modern front-end technologies such as React or Angular. We embrace SOLID principles, clean code, and software craftsmanship to ensure engineering excellence. Duties and Responsibilities: Full stack development of applications and infrastructure to support our telephony and CRM integration and related reporting.Own crafting of comprehensive, scalable, and high performing web applications used by our Patient Ambassadors in our contact centers.Integrate SaaS applications using RESTful services with a variety of Azure Cloud services.Support our existing production and non-production systems while continuously working to improve them.Implements, maintains, and monitors operational systems.Be available to help with critical customer issues that are reported to the Application Support personnel. This includes reproducing and documenting production issues, analyzing logs, or clarifying intended functionality.Takes full ownership of software issues through completion or hand-off to another internal technology employee.Participates in team meetings, providing input and suggestions on the design, implementation, and maintenance of Technology systems and the overall Technology strategy.Minimize technology systems issues through partnership.Analyzes escalated ticket submissions to determine patterns of issues that indicate a larger issue, proposes, and implements solutions to those issues.Analyze systems monitoring data to suggest systems upgrades and capacity expansion where appropriate.Partners with all departments in the business identify areas of process or systems improvement and suggest system and process changes to address these opportunities. Experience:Must have a proven record of delivering web-based software using C#, .NET Core, Entity Framework, in a cloud-based environment.Proficiency in applying SOLID design principles for enhanced maintainability and scalability of code.Strong experience in Unit Testing and Test-Driven Development (TDD) practices to ensure code reliability and quality.Experience producing and consuming RESTful services.Experience developing with modern front-end technologies such as React, Angular, HTML5, and CSS3.The ability to communicate technical information to nontechnical personnel.Verbal and written communications skills.Identifying and resolving software systems and integration issues. Required qualifications:2-4 Years’ experience with .NET Core and Entity Framework.2-4 Years’ experience with SQL programming.2-4 Years’ experience consuming and creating RESTful web services.Knowledge of modern front-end frameworks such as React or Angular. Preferred qualifications:Azure Cloud technologies such as Azure Functions, Azure Web Apps, Azure SQL, Service Bus, and related IaaS and PaaS solutions.Azure DevOps experience creating and maintaining Pipelines in a Continuous Integration (CI) and Continuous Delivery (CD) environment.JavaScript and TypeScript.The candidate should have a bachelor's degree in computer science, related field, or certification and a minimum of 2 years of relevant experience. Additional experience may be substituted for education/certification requirement.Keywords: Software Engineer, .NET, C#, ASP.NET, Entity Framework, SQL, RESTful Services, React, Angular, Azure Cloud, Web Applications, Serverless Architecture, Full Stack Development, CRM Integration, Telephony Systems, SaaS Integration, Azure Functions, Azure Web Apps, Azure SQL, Service Bus, IaaS, PaaS, DevOps, Continuous Integration (CI), Continuous Delivery (CD), JavaScript, TypeScript, HTML5, CSS3, Software Development. Compensation: At Sono Bello, we believe that our team members are the keys to our success. The compensation range for this role is $130,000- $150,000, depending on experience. Benefits: Benefits Package including Medical, Dental, Vision, Life Insurance, 401K, EAP, PTO, and paid holidays.",
    "jobId": 3790093855,
    "workplaceType": "",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C560BAQH3MzMt8Eq4GQ/company-logo_400_400/0/1661200935969/sono_bello_logo?e=1712793600&v=beta&t=mKB0DkFHX5rcOBUtnoeEF-FXLcbxjSKoR0D1aAW2VJE",
    "applyUrl": "https://www.linkedin.com/job-apply/3790093855",
    "experienceLevel": "Associate",
    "applicantsCount": 326,
    "viewsCount": 641,
    "companyStaffCount": 737,
    "companyDescription": "In just over a decade, Sono Bello® has grown into an industry leader with 80+ locations spanning across the United States. Our growth is made possible by an amazing team of board-certified surgeons that are now over 185 strong, as well as our entire team of dedicated Sono Bello® employees. With our eyes to the future, we look forward to opening even more locations in the coming years. We also look forward to further advances in the tools and techniques of our craft, so we can always provide our customers with the most advanced micro-laser liposuction procedures and the most amazing results available. Sono Bello® believes body cosmetic procedures to be both a science and an art. Over the years, we’ve seen that when the two work together seamlessly, lives are changed for the better. This is why our team of highly skilled physicians only specialize in total body transformation, and it’s how we’ve been able to positively impact the lives of thousands of women and men nationwide since our beginning. Are you interested in joining the Nation’s largest and fastest growing cosmetic surgery practice? Check out our careers page for opportunities: https://www.sonobello.com/careers/",
    "jobIndustries": "Medical Practices",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:21:28.674Z",
    "query": "https://www.linkedin.com/jobs/view/3790093855/?eBP=CwEAAAGM-UlrCOr7gpdyCgheRFAaSJpucVECThbjFCYaM4Zp9DsevyexazbJQkjNtMdq2i2e3wtbvl8we96jzhfSWTfhUceXKokApXyu2b3-ZroHMGZGvxJX9PlCMW5-J0vT-6TDsYzriAks4UsQ2Pp1OzU8ZaH494HbeKck8P-ygAorj0QvsbFg93j6UBY4zdRsptRWIiXD0UZT4NQyDtQcIUsNvExTDrPVhOKdAS2kGkumocScDoY28RmNbsP4Jc8lA5PeUZrhXNpKkdinq2CV9Ml8AaeApLsfNQU903BHMq7p7Swd6yHQ791SbAIN56mZgJwwuS33kAL4bx5oPIm2c3L6hh_kBc6darNJrWO0m3rEPj_PkcN-VOho82F535yx2a3kzJIXBg&refId=9UrnTbJl3cXSds689sB%2BXQ%3D%3D&trackingId=zOnIqTNw%2BWvRnwNvzw07sw%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/ledgent-technology",
    "companyName": "Ledgent Technology",
    "jobTitle": "Software Engineer 2",
    "jobLocation": "Bellevue, WA",
    "postedAt": "2024-01-08T21:23:13.000Z",
    "appliesClosedAt": "2024-02-07T21:22:35.000Z",
    "jobDescription": "Role: Software Engineer 2Position Type: Direct Hire- Full TimeLocation: Bellevue, WA- OnsiteAnnual Salary: $120K-140K# of Openings: 2 Ledgent Technology has once again partnered with a key employer in the Bellevue, WA market for their open Software Engineer 2 roles! This client is seeing some awesome positive changes and major growth initiatives in the IT Department, you don't want to miss out on this opportunity!! POSITION SUMMARYSoftware Engineer II is responsible for driving technical decisions, a pillar for sound quality and architecture and a mentor for newer engineers.We're looking for passion, smarts, ownership, and a good personality to work in a highly collaborative organization.Experience working across infrastructure, web services, and front-end stack in a distributed architecture is a bonus. In addition to experience and a track record of collaborating with a multitude of teams across the globe. RESPONSIBILITIES Flexibility in ramping up on new technologyDesign and build tooling and infrastructure to help engineering teams measure and increase their velocityDesign, develop, document, and thoroughly test your code with the CI/CD frameworkBuild your own automation and reporting tools to provide capabilities around the components/applications you own and will participate to troubleshooting production issuesSupport post-deployment fallouts on projects worked on and released to productionPrototype creative solutions quickly, and be able to takes project from prototype to production qualityCreative and willing to explore lots of avenues and options because you work on features that really can't be cutWork well in a Scrum team and with the product organization as a team working toward the same goal by evaluating requirements and create tasks in backlog as neededActively monitor tech debt needs and communicate the importance as well as suggesting a path to completion QUALIFICATIONSBS degree in Computer Science, similar technical field of study or equivalent practical experienceC#, .NET, Angular, Azure infrastructure, and SQL database are required4+ years industry experience writing code and have a passion for solving complex problemsStrong interpersonal skills, as well as strong problem solving and analytical skillsWorking knowledge of Agile Software Development methodologies (scrum, XP)Solid understanding of Object-Oriented Programming concepts, data structure, algorithms, and system level programming (including multi-threaded programming) We are an equal opportunity employer and make hiring decisions based on merit. Recruitment, hiring, training, and job assignments are made without regard to race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, or any other protected classification. We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance. All qualified applicants will receive consideration for employment without regard to race, color, national origin, age, ancestry, religion, sex, sexual orientation, gender identity, gender expression, marital status, disability, medical condition, genetic information, pregnancy, or military or veteran status. We consider all qualified applicants, including those with criminal histories, in a manner consistent with state and local laws, including the City of Los Angeles' Fair Chance Initiative for Hiring Ordinance.",
    "jobId": 3797058020,
    "workplaceType": "On-site",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C560BAQEe2qjn2FZE3Q/company-logo_400_400/0/1677532956136/ledgent_technology_logo?e=1712793600&v=beta&t=us5uDyP-fKp1tkIEkQ5jXCFE6tkmUSqzEhLQtLzc8ZE",
    "applyUrl": "",
    "experienceLevel": "Entry level",
    "applicantsCount": 165,
    "viewsCount": 407,
    "companyStaffCount": 97,
    "companyDescription": "Ledgent Technology understands that IT teams have specialized talent acquisition needs. Our team of experts uses the latest technologies and processes to recruit qualified IT professionals throughout the nation. We provide professionals in the following areas: ► Program Managers ► Architects ► Business Systems Analysts ► Programmers ► Web Developers/Designers ► QA/Testing Specialists ► ERP/CRM Specialists (Functional and Technical) ► Database Administrators (DBA) ► Network Administrators ► Help Desk Specialists ► Technicians ► ...and more! Ledgent Technology, together with our sister business lines, currently operates from more than 100 locations in nearly every major metropolitan market in the U.S. and is considered one of the largest staffing companies in the U.S. by Staffing Industry Analysts. We are proud of being the only staffing company recognized with all the industry’s top awards for... ► The Best Staffing Firm to Work for ► The Best Staffing Firm to Temp for ► The Best in Client Service It’s a great company. We get to make life better for people and to create remarkable experiences every day. We are just a new and different kind of staffing company! Ledgent Technology is an Equal Opportunity Employer – M/F/Veteran/Disability/Sexual Orientation/Gender Identity Company Purpose: ► To make life better for the people we serve.® Company Promise: ► We love to create remarkable experiences... every person, every time.® Honors and Awards: ► Over the past year alone, our parent company was recognized by Fortune Magazine six times, including as the #11 Best Medium Workplace in the U.S. We were also named one of Achievers Most Engaged Workplaces in North America, ABA’s Employer of the Year, and SIA’s Best Staffing Firms to Work For. For our Ambassadors, we have been recognized with SIA’s “Best Staffing Firms to Temp For,” and ClearlyRated’s Best of Staffing® Talent Diamond Award. Roth is the only staffing company to ever be ranked #1 on the Inc. 500.",
    "jobIndustries": "IT Services and IT Consulting",
    "jobFunctions": "Information Technology",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:21:34.772Z",
    "query": "https://www.linkedin.com/jobs/view/3797058020/?eBP=CwEAAAGM-UlrCB77ijZoIeeNhjPjS5rNS8dzddl--75PBRniZGOT2OHoXS6B0U9fuBA3D18sKr_zolateFszbqcRF4VQDVhugpknJI6a9zkO19sjpKdpJcMpDwCrgdBZGTrr-xUIy77HKVZs6EbywT4GksA9yd_9cvGjjQFigxwyde7L4sm1Zeuv6MzR7H5e9WVAaIEEOzimsgGK8O3fmAa2ZG3DOXA2xXtoDkvC2ind0uCZhJi1bH_h8l-ciMparnZIamXWae19-T6yDMehnYVeBWNf3OHLrtNNbB_JxFrRNU3yvFIFlSsr0jhaf_JSYjHCCvs_axFH1fgistAdwJ9HiqEH6qdHsN2ohaCTrtyA819O8DnMEhCQpaxSsxzEVrVemajzjp0&refId=9UrnTbJl3cXSds689sB%2BXQ%3D%3D&trackingId=uElyZAmZ%2FtCrySqRc%2B4B9Q%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/callihegner",
    "jobPosterName": "Calli H."
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/truveta",
    "companyName": "Truveta",
    "jobTitle": "Cloud Software Engineer",
    "jobLocation": "Seattle, WA",
    "postedAt": "2024-01-09T17:44:25.000Z",
    "appliesClosedAt": "2024-02-08T17:44:25.000Z",
    "jobDescription": "Truveta is the world’s first health provider led data platform with a vision of Saving Lives with Data. Our mission is to enable researchers to find cures faster, empower every clinician to be an expert, and help families make the most informed decisions about their care. Achieving Truveta’ s ambitious vision requires an incredible team of talented and inspired people with a special combination of health, software and big data experience who share our company values. This role is based in the greater Seattle area at our office in Bellevue, Washington. Who We Need Truveta is rapidly building a talented and diverse team to tackle complex health and technical challenges. Beyond core capabilities, we are seeking problem solvers, passionate and collaborative teammates, and those willing to roll up their sleeves while making a difference. If you are interested in the opportunity to pursue purposeful work, join a mission-driven team, and build a rewarding career while having fun, Truveta may be the perfect fit for you. This Opportunity Patients, Doctors, and medical researchers deserve to benefit from large scale technological innovations and digital intelligence that have driven progress in office productivity, entertainment and social networking. We are looking for software engineers excited by the opportunity to improve health care in far-reaching ways. To realize this goal, we are looking for creative and capable intermediate cloud software engineer to lead and build modern automation tools to streamline our engineering processes. In this position, you will have an opportunity to collaborate with internal users, analyze their use cases, requirements, and expectations, lead and develop scalable, secure, and cost-effective cloud-based software solutions to remove inefficiencies, pain points, and enable the users to deliver faster and more. This opportunity allows you to interact with senior/principal software engineers across the company to define our company software future direction and long-term strategy, technology selection, and you will make big impact to our business success. This opportunity also requires your influence, mentorship, and guideline for junior software engineers, optimize their code quality, improve their code security, and guide them follow SDLC best practice and help them grow. We Are Seeking Intermediate Cloud Software Engineer Who Has proven experience building reliable, secure, and scalable software solutions using modern cloud-based paradigms.Knows how to iterate and evolve a software solution with new learned technologies while carefully balancing the needs of privacy, security, and reliability.The ability to write high-quality, efficient, and easily testable code.The ability to contribute in all phases of software development lifecycle.Manages source control, CI/CD pipelines and new features/products release.Participates in high impact project initiatives, sprint planning, removal of roadblocks and ensure on-time delivery with quality.Is willing to review code, provide feedback to ensure best practices.Is willing to commit to ongoing training on key topics like privacy, compliance, and security.Is willing to join on call rotation to triage production software issues and recover services quickly. Key Qualifications Bachelor's/ MS Degree in Computer Science, or related technical discipline or equivalent years of experienceDemonstrated working knowledge translating a business requirement to a functional design, development, testing and implementation.Excellent teamwork and time management skills with the ability to work well under pressure, meet set deadlines, complete tasks with minimal supervision and complete overlapping projects.3+ years of coding experience building production quality software in a team setting is a must.2+ years of experience building cloud apps (UX and/or backend) with programming languages like .NET, Java, Node.js, React is a must.2+ years of experience with RESTful APIs to support API-driven services for system-to-system usage.Strong experience on modern cloud-native platforms (AWS, GCP, Azure)Strong hands-on on DevOps tools such as GitHub, CI/CD pipelines, Azure DevOps experience is a big plus.Prior work with Azure Platform including Azure Web Apps, Azure Storage account, SQL Database, Service Bus, Microservice is a plus.Prior work with Azure Kubernetes Service, containerized application development is a plus.Knowledge of Azure Networking, Azure Firewall, Azure Key Vault, etc. related Azure Security is a plus. Preferred Qualifications Experience in implementation & securing platforms/services in one or more public clouds (Azure, AWS, GCP) Self-starter with proven ability to develop creative solutions that enable customers and cost efficiencyInterest and ability to research new and emerging technologies to better solve cloud infrastructure problems or improve security postureCertifications in Cloud/Network/Security (such as Azure AZ500, AZ700, Cisco CCNA/CCNP, Fortinet NSE 3-6, Palo Alto PCNSE, etc.) Why Truveta? Be a part of building something special. Now is the perfect time to join Truveta. We have strong, established leadership with decades of success. We are well-funded. We are building a culture that prioritizes people and their passions across personal, professional, and everything in between. Join us as we build an amazing company together. We Offer Interesting and meaningful work for every career stageGreat benefits packageComprehensive benefits with strong medical, dental and vision insurance plans401K planProfessional development & training opportunities for continuous learningWork/life autonomy via flexible work hours and flexible paid time offGenerous parental leaveRegular team activities (virtual and in-person as soon as we are able)The base pay for this position is $94,000 to $153,000. The pay range reflects the minimum and maximum target. Pay is based on several factors including location and may vary depending on job-related knowledge, skills, and experience. Certain roles are eligible for additional compensation such as incentive pay and stock options. If you are based in California, we encourage you to read this important information for California residents linked here. Truveta is committed to creating a diverse, inclusive, and empowering workplace. We believe that having employees, interns, and contractors with diverse backgrounds enables Truveta to better meet our mission and serve patients and health communities around the world. We recognize that opportunities in technology historically excluded and continue to disproportionately exclude Black and Indigenous people, people of color, people from working class backgrounds, people with disabilities, and LGBTQIA+ people. We strongly encourage individuals with these identities to apply even if you don’t meet all of the requirements.",
    "jobId": 3802177442,
    "workplaceType": "Remote",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQF0Zt9VtenlmA/company-logo_400_400/0/1701906117598/truveta_logo?e=1712793600&v=beta&t=i9MTZPpZ8NTpIxdb-3NJPSNTaTmDjSbI-ZCBwYgJ8Iw",
    "applyUrl": "https://www.linkedin.com/job-apply/3802177442",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 220,
    "viewsCount": 635,
    "companyStaffCount": 286,
    "companyDescription": "Truveta delivers the most complete, timely and clean EHR data, empowering researchers to improve patient care, accelerate R&D, and inform public policy.",
    "jobIndustries": "Software Development, Technology, Information and Internet, IT Services and IT Consulting",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:21:40.938Z",
    "query": "https://www.linkedin.com/jobs/view/3802177442/?eBP=CwEAAAGM-UlrCFuBhcueY4gEiXqAz2NEHz19wAnpgklJOVpnMh-5wep-QtcNtXdSO0RIaK-NjShjvM_nRAYtzJW-0hVi_oEzVM_XojHQnMzV-_fI-lnbCIpZcwIo65Nl_oGvAljftqYxQ8uv5qdZybN8YT3uRG9l_B-R9FY_Ou6PKHIRxKZpxLGY-hmA9UfONslS-dBLIc9wfMK-v2corBoiVVTXu8gaIYCb5UhDPgFqTciQ5PIvzPw4XcnS7IDGzLKmnKGlmvzfHmxI4BB4wm6vt62_gxkcHrKRge3H6KPC3qGWYuvc4n6pguY6DT6vZLkoplcPctSjW6nygeJGqLVzdIS28m5NjqXZtGsS68SirM0u-RqkBkc1wHsvtnVikdkHpDjy&refId=9UrnTbJl3cXSds689sB%2BXQ%3D%3D&trackingId=ANPFH9ggAE%2FonVMQ5oVkiA%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/jerrytozhang",
    "jobPosterName": "Jerry Zhang"
  },
  {
    "jobPosterEmail": "lcarey@ctp-inc.com",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/ctpconsulting",
    "companyName": "CTP",
    "jobTitle": "Software Engineer",
    "jobLocation": "Seattle, WA",
    "postedAt": "2023-12-22T17:34:32.000Z",
    "appliesClosedAt": "2024-01-21T17:34:32.000Z",
    "jobDescription": "Title: Software EngineerLocation: Seattle WADuration: 3 Months plus extensionsCompensation: $65-70/hour SUMMARY:We are looking to hire a Full Stack Engineer to join our clients AIML Data Platform team within the Machine Learning Platform and Technologies. You will work with cross functional teams to create the main entry portal for machine learning engineers and data scientists to learn and explore the data platform infrastructure and learn about our tools. RESPONSIBILITIES: You will be responsible for refreshing the main web portal experience for AI/ML Data infrastructure platform. This is the main entry point for engineers and teams to learn about the data platform offerings, interact with machine learning services, data platform services, and read user guides, and documentation.Build new portal experiencesCollaborate across AI/ML teams to analyze front end needsEvolve and modify UI tools based on requirementsWrite code, documentation, participate in code reviews QUALIFICATIONS/EXPERIENCE:· Have a passion about building UI experiencesStrong knowledge of ReactJS, CSS / styles, and NodeJSExperience with alerting, monitoring and deploymentsExcellent communication and collaboration skillsExperience with AWS and EKSBS, MS, or PhD degree in Computer Science or equivalent experience",
    "jobId": 3786729461,
    "workplaceType": "Remote",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQGE4Kr8d2D_vg/company-logo_400_400/0/1696955500662/ctpconsulting_logo?e=1712793600&v=beta&t=I0LXrTN3_PN5Vn0QTeGjr2tYUa7RK6M4wyVnykrVdpA",
    "applyUrl": "https://www.linkedin.com/job-apply/3786729461",
    "experienceLevel": "Associate",
    "applicantsCount": 1205,
    "viewsCount": 2642,
    "companyStaffCount": 32,
    "companyDescription": "CTP is a certified Women's Business Enterprise (WBE) headquartered in the dynamic hub of Silicon Valley. We are a full-service IT and creative consulting and staffing services firm where we live our passion for the people behind the technology. Our difference lies in our approach: • We value transparency • We work diligently to build a culture that inspires commitment • We delve deep into understanding your greatest challenges, enabling us to seamlessly align our team with yours The track record of our team speaks volumes about our ability to deliver high-quality, cost-effective solutions that go far beyond filling an open role. By equipping you with indispensable resources and expert market insights, we empower you to achieve your goals. Technology and Creative Services At CTP, we focus on our strengths. Our team is comprised of specialists that deliver solutions within two distinct areas: Technology and Marketing & Creative. For many of our clients these needs tend to intersect within their organizations, leaving us in a unique position to offer a multifaceted solution. While not an exhaustive list, our services include end-to-end planning, architecture, execution, adoption, communication, brand and change management. We are able to support your organization’s largest initiatives, whether they be digital transformation, large-scale implementations, software development, marketing or brand management. Government Services The realm of government contracting is intricate, and we embrace this complexity. Agencies and prime contractors alike need partners that understand the importance of delivering your mission-critical objectives. The CTP Government Services team is made up of industry veterans with more than 20 years of experience helping to advance the needs of customers across the Federal Civilian, Federal Health, and Defense markets. Our promise is to never lose sight of the “why” when it comes to supporting your mission.",
    "jobIndustries": "Retail Appliances, Electrical, and Electronic Equipment, Technology, Information and Media",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Contract",
    "timestamp": "2024-01-11T23:21:47.034Z",
    "query": "https://www.linkedin.com/jobs/view/3786729461/?eBP=CwEAAAGM-UlrCPTnNyep0j2RlqSmL9T8PoB2YVznIukqUfBPbu0eRgNZ1aYSPixY0gmFS9BJ4e-jUOGJd22vede37v2kTPpYaPHPdiIBgUzNAQKfoO-o87QX5QtpG5s7k9ofHEnUn7rG6b97vVPiJKZM3HCCoGtZtImcfVdwcUKfM0V4Gs4bFSqBw7i5uXVbfnxkzyXHQTK4CqJqH9NLxm8LJUqPko6r_6-hIiW3J8DckrjXnt7UJksYJcBIny23vYW9pjdkpj48ttWA21jt7RdMszd44MNYRCS2qUFGocLmhASiMYwR0pdEqcSsFVJ5P-XhLJzTBpMiWc6uqG-FTrI9p8tSGglNTWSHOdNzmBZjmA6b4bEC8DqyrTpTYMr9sVzpeAnOI-llFw&refId=9UrnTbJl3cXSds689sB%2BXQ%3D%3D&trackingId=ZckhcluLuldZ3EsKu9HQgA%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/liza-carey",
    "jobPosterName": "Liza Carey"
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/cybercoders",
    "companyName": "CyberCoders",
    "jobTitle": "Software Engineer (AI & ML) - REMOTE!",
    "jobLocation": "Seattle, WA",
    "postedAt": "2024-01-11T09:16:15.000Z",
    "appliesClosedAt": "2024-02-10T09:16:15.000Z",
    "jobDescription": "If you are a Senior Software Engineer - (AI & ML) with experience, please read on! We might be a small team startup company but that doesn't mean we're not fierce and making a huge impact in our industry. With 40% YoY growth we're taking over space at a rapid rate and have no plans of slowing down... don't worry though, even though we work hard here we also make sure that hard work stays within our 8-hour a day / 40-hour a week policy to ensure every employee has time for the fun stuff outside of work! Our founders know what they're doing - this isn't their first rodeo - they've previously won multiple awards recognized globally with other small companies they've started! By taking care of our employees, being profitable, and offering exceptional value to our clients with our easy to use SaaS product, we've created the key to success. What You Will Be Doing Involved with all things Machine Learning & AI in the following areas on your team: Mentoring Training Evaluating Models Optimizing - performance & scalability Creating and building - new & existing features Designing & Developing - leading in this area Continuous learning with the latest trends Refining What You Need for this Position 7+ years of hands on experience in software development Very strong experience w/developing tools for Machine Learning Proficiency in web development technologies, including React, JavaScript, CSS, HTML, and related frameworks Experience in preprocessing, data visualization, feature engineering Previously designing and implementing generative AI models by leveraging LLMs (Large Language Models) for text generation Excellent programming skills in C++, python, java Deep knowledge of data structures, algorithms, statistical modeling know how to deploy & maintain ML models in components of enterprise solutions Understanding of Machine Learning and Deep Learning libraries such as Hugging Face, PyTorch, scikit-learn, and TensorFlow Previously experience w/big data technologies like Hadoop, Spark, or distributed computing frameworks Familiarity with GraphQL, including the use of Apollo Client and/or Relay Strong communication and documentation skills What's In It for You VERY competitive salary REMOTE work Work life balance (40 hours a week - no more!) Health insurance for you and your family (vision/medical/dental) 401k & matchings Continuing education allowance yearly PTO Sick pay Holiday pay Wellness reimbursement Family leave (moms and dads) A WHOLE BUNCH MORE! Benefits Vacation/PTO Medical Dental Vision 401k So, if you are a Senior Software Engineer - (AI & ML) with experience, please apply today! Colorado employees will receive paid sick leave. For additional information about available benefits, please contact Ellery Fraser Email Your Resume In Word To Looking forward to receiving your resume through our website and going over the position with you. Clicking apply is the best way to apply, but you may also: Ellery.Fraser@CyberCoders.com Please do NOT change the email subject line in any way. You must keep the JobID: linkedin : EF6-1770941L367 -- in the email subject line for your application to be considered.*** Ellery Fraser - Recruiter - CyberCoders Applicants must be authorized to work in the U.S. CyberCoders is proud to be an Equal Opportunity Employer All qualified applicants will receive consideration for employment without regard to race, color, religion, sex, national origin, disability, protected veteran status, or any other characteristic protected by law. Your Right to Work – In compliance with federal law, all persons hired will be required to verify identity and eligibility to work in the United States and to complete the required employment eligibility verification document form upon hire.",
    "jobId": 3747105580,
    "workplaceType": "Remote",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C560BAQF7t9X4k2P2hA/company-logo_400_400/0/1630672294143/cybercoders_logo?e=1712793600&v=beta&t=m_0_MfgzYhcuE7Ut6mKwOaMxOyGvg5MZSY7pjkSDkT4",
    "applyUrl": "",
    "experienceLevel": "Internship",
    "applicantsCount": 911,
    "viewsCount": 3168,
    "companyStaffCount": 1100,
    "companyDescription": "CyberCoders, a division of ASGN Incorporated, is a leading permanent placement recruiting firm. Every year, thousands of top professionals trust our skilled recruiters to find them great jobs at amazing companies. Whether you’re looking for a job or looking to hire, CyberCoders can help. Founded in 1999, we have filled tens of thousands of positions in every industry including technology, engineering, construction, manufacturing, accounting, finance, mortgage, healthcare, and biotech. With a nationwide presence, we’ve been named one of America's Best Professional Recruiting Firms by Forbes multiple years in a row. What makes us different? Our proprietary recruiting technology, Cyrus, and collaboration among 250 recruiters allow us to deliver qualified candidates fast from anywhere in the U.S. Our quality-oriented approach results in successful long-term placements.",
    "jobIndustries": "Software Development",
    "jobFunctions": "Engineering",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:21:53.211Z",
    "query": "https://www.linkedin.com/jobs/view/3747105580/?eBP=JOB_SEARCH_ORGANIC&refId=zmuvGHLStGN4MTN9arQmLg%3D%3D&trackingId=C9hIz2C8%2FGr%2BfpVtRE25Bw%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  },
  {
    "jobPosterEmail": "",
    "status": "",
    "companyUrl": "https://www.linkedin.com/company/mantl",
    "companyName": "MANTL",
    "jobTitle": "Full-Stack Software Engineer",
    "jobLocation": "United States",
    "postedAt": "2023-12-08T04:47:04.000Z",
    "appliesClosedAt": "2024-02-03T05:16:57.000Z",
    "jobDescription": "As a Full-Stack Software Engineer You Will Build the core experiences of both bank administrators and bank customers. The includes crafting streamlined user flows, building robust APIs, and integrating with third-party software like Plaid or Sendgrid. About You You love writing clean, thoroughly documented, and well-tested code, with an eye for long term viability and performance.You measure twice and code once when writing features, placing an emphasis on error-handling, logging, and edge cases for every service you write.You enjoy the challenge of breaking down complex product asks into elegant solutions.You are comfortable and experienced with system design, and not only have architectural opinions but are comfortable writing, speaking, and advocating for them.You approach architectural challenges not with answers but with questions, and from those questions decide upon the best approach, knowing that there is no best solution, only different sets of tradeoffs to be made.You enjoy providing technical guidance, suggestions, and code reviews for your teammates, using your knowledge to raise the bar of their work as well. We Are Looking For 3+ years professional experience with front end technologies (JavaScript, React, Vue, etc.)Exposure to backend services (NodeJS, NestJS)Well versed with REST APIsExperience working in an agile SCRUM environmentWell versed with domain driven designWell versed with Microservice architecture What We Offer MANTL offers competitive compensation package including base salary, equity and benefits. Base salary for this role is $145,000 - $165,000, though this is subject to change based on performance and market conditions.100% covered medical, dental and vision insurance for employees & 50% coverage for families. Unlimited PTORemote set-up allowance of $400Creative and fun team-building events (improv, chocolate and wine tasting, happy hours)Mental health and wellness programsAnd more! Who is MANTL? MANTL is a fast-growing remote FinTech SaaS company on a mission to build technology that will help America’s financial institutions and their communities thrive. Think Shopify, but purpose-built for community banks and credit unions. Our modern banking software helps level the playing field for smaller banks and credit unions by enabling them to grow digitally. Our deposit origination platform is widely considered best-in-class in our industry, showing clear and material performance beyond any of our competitors. Check out what our CEO has to say about MANTL’s impact here. Our investors include CapitalG, Point72, ClockWork, and BoxGroup. The MANTL Culture Joining MANTL means joining an ambitious and exceptional team that solves complex problems every day. People are our most important asset and the top reason we love working at MANTL. We're a group of passionate technologists who support an accountable, transparent, and collaborative culture that fosters productive and engaging discussions. We want to work with inclusive people who understand the importance of treating their colleagues exceptionally well. We’re always a work in progress — and we’re proud to be named one of Crain’s 100 Best Places to Work in New York City for two years running. MANTL is an Equal Opportunity Employer. We do not discriminate against qualified applicants or employees on the basis of race, color, religion, gender identity, sex, sexual preference, sexual identity, pregnancy, national origin, ancestry, citizenship, age, marital status, physical disability, mental disability, medical condition, military status, or any other characteristic protected by federal, state, or local law, rule, or regulation. This employer participates in E-Verify and will provide the federal government with your Form I-9 information to confirm that you are authorized to work in the U.S.",
    "jobId": 3782576496,
    "workplaceType": "Remote",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQFdxJkIulYK9g/company-logo_400_400/0/1688569813333/mantl_logo?e=1712793600&v=beta&t=Z_UkxicC-Q_yXkBi6BbXyATN6UMSQsO4crY1QEzCj8k",
    "applyUrl": "https://www.linkedin.com/job-apply/3782576496",
    "experienceLevel": "Entry level",
    "applicantsCount": 651,
    "viewsCount": 1796,
    "companyStaffCount": 107,
    "companyDescription": "MANTL is an enterprise SaaS company helping traditional financial institutions modernize and grow. Our mission is to expand access to financial services. We are tackling the biggest challenge limiting the modernization of the U.S. banking system: legacy infrastructure. Our software transforms the cost structures of banks and credit unions – empowering growth that’s up to 10x more cost-effective than building a brick-and-mortar branch. MANTL’s white-labeled account opening platform enables people to open deposit accounts on any device in roughly 2 minutes and 37 seconds. MANTL began as a challenger bank when an aha moment inspired the founders to pivot from competing to partnering with banks to deploy its technology at scale. We help community institutions raise billions of dollars in core deposits each year and are proving that they can compete online with the right set of tools. MANTL is a privately held company headquartered in New York with the backing of such prominent investors as Alphabet's CapitalG, Point72Ventures and D1 Capital Partners. We are hiring! If you are interested in joining our growing team or scheduling a demo, please visit our website: http://www.mantl.com",
    "jobIndustries": "Financial Services",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-11T23:21:59.306Z",
    "query": "https://www.linkedin.com/jobs/view/3782576496/?eBP=JOB_SEARCH_ORGANIC&refId=zmuvGHLStGN4MTN9arQmLg%3D%3D&trackingId=jiWbwsb%2FlBfX4JHK6pxzGQ%3D%3D&trk=flagship3_search_srp_jobs",
    "jobPosterProfileUrl": "",
    "jobPosterName": ""
  }
]
