[
  {
    "jobPosterEmail": "Natalie Inchiosa",
    "companyUrl": "https://www.linkedin.com/company/idrinc",
    "companyName": "IDR, Inc.",
    "jobTitle": "Embedded Software Engineer",
    "jobLocation": "Boise, ID",
    "postedAt": "2023-12-13T14:20:16.000Z",
    "appliesClosedAt": "2024-01-12T14:20:16.000Z",
    "jobDescription": "IDR is seeking a Embedded Software Engineer to join one of our top clients in Boise, ID. If you are looking for an opportunity to join a large organization and work within an ever-growing team-oriented culture, please apply today!\nPosition Overview for the Embedded Software Engineer:Design, develop, implement, and support software solutions in relation to embedded firmware systems.Step into the Product Life Cycle to implement software solutions impacting quality improvement, cost reductions, and technical support.Develop embedded firmware systems in support of a manufactured product.\nRequired Skills for the Embedded Software Engineer:Bachelor’s degree in Electrical Engineering, Computer Engineering, or equivalent3+ years of experience with C++2+ years of experience with Linux and GNU tool chain2+ years of electronic knowledge\nWhat’s in it for you?Competitive compensation packageFull Benefits; Medical, Vision, Dental, and more!Opportunity to get in with an industry-leading organizationClose-knit and team-oriented culture",
    "jobId": 3780628305,
    "workplaceType": "On-site",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/natalie-inchiosa-8276211b3",
    "jobPosterName": "Natalie Inchiosa",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQHpu2gLxz2S0Q/company-logo_400_400/0/1688151992962/idrinc_logo?e=1712793600&v=beta&t=r0IaQ1faUB0XzuIpzvHBij2bEznwcbOq8U3vS9q24D4",
    "applyUrl": "https://www.linkedin.com/job-apply/3780628305",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 142,
    "viewsCount": 464,
    "companyStaffCount": 477,
    "companyDescription": "IDR, Inc. is an award-winning, employee-owned staffing firm with headquarters in Alpharetta, GA and offices in the Nashville, Dallas, and Denver markets. Founded in 1998, IDR has grown to serve businesses and professionals across industries including IT, healthcare, government services, and professional services.\n\nRecognized for our expertise and the high-touch approach of our Engagement Management Program, IDR continues to build rewarding partnerships with companies and consultants. Our best-in-class service has earned IDR ClearlyRated’s Best of Staffing Client and Talent Diamond awards for ten consecutive years, in addition to awards from Staffing Industry Analysts, ClearlyRated’s Best Staffing Firms for Women, and Best and Brightest Companies to Work For.\n\nWith our commitment to empowering talent and developing leaders, we’re passionate about what we do and how we do it, and we look forward to working with you. ",
    "jobIndustries": "Staffing and Recruiting",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-10T18:25:16.173Z",
    "query": "https://www.linkedin.com/jobs/view/3780628305/?eBP=CwEAAAGM9JOxYptqf1Tsbr3Dur9zPUhfdKoNWMX6Yo1Zbv9e_w-IfaZ5XXyBWeokBWeMNM3aYjCYPDFDf7W5i0vMwU7sUcCa1_9MMC8TNFWfuPygksYVrX5HdeamgOHJxOci5PKiCLDO7cv0UkMH-ekmod8WLgxVI0ppK66WV3jcAeaZ3KPsKQjKwv9wRt4Rye8ofSbqxTxvgsrjqVYkKYBJL6fW0fv4ocHrbOFvbYOUtSpM7fDDZUfBF_z7CVRHkQ2E-tuwJmHUhgY01tBl7G3VUsOyIvtrUbC-o2du083YKLkXHQzFKdP8NkDxQHxHEcbGEotEwB4HjfZ8C3ELx8DOFwIymgxfc1d1qkGMe89VHBRxhlzcuUpJ3Cp4-lX6fGfZlVZmu5M&refId=Vm67jnqUZjOTfrqD9QPdFA%3D%3D&trackingId=mj85UbTvGg4aIXtU2OSLSg%3D%3D&trk=flagship3_search_srp_jobs#/"
  },
  {
    "jobPosterEmail": "Nathan Crooks",
    "companyUrl": "https://www.linkedin.com/company/resourcedata",
    "companyName": "Resource Data",
    "jobTitle": "Senior Software Engineer",
    "jobLocation": "Boise, ID",
    "postedAt": "2024-01-04T17:57:35.000Z",
    "appliesClosedAt": "2024-02-03T17:57:35.000Z",
    "jobDescription": "As a Senior Software Engineer with Resource Data, you’ll help design and develop software solutions that elevate enterprise systems efficiency, performance, and value. You’ll join a team of high-achieving technical consultants and help provide solutions to our clients' most challenging enterprise IT problems.\n\nKey Responsibilities\n\nAnalyze, design, develop, and test software modules in support of clients' software application development projectsDeliver solutions with Agile project teams that adhere to business needs, technical requirements, workflow, budget, timeline, and resourcesProvide subject matter expertise in building estimates, proposals, and architectural trade-offs\n\nBasic Qualifications\n\n5+ years' professional software development experience1+ years' experience working in Agile software development teamsExperience programming in C#, .NET Frameworks, and SQL Server\n\nPreferred Qualifications\n\n1+ years' experience in a client-facing roleBachelor's degree in computer science or equivalent\n\nAbout Us\n\nFor more than 37 years, we’ve designed and built innovative technology solutions for our clients most complex challenges. We work on diverse projects spanning different industries, tech stacks, and systems. Forming strong partnerships with our clients is a cornerstone of our success. As a result, we’ve expanded to 5 locations and more than 200 employees.\n\nWe Believe in Team\n\nWe come from diverse backgrounds, not just IT, and have a wide range of interests. This diversity brings unique perspectives and insights to our work. You’ll always find support from coworkers—no matter their role or location. We believe in working together, pooling our ideas and expertise to achieve amazing results. Together, let’s conquer challenges and grow our skills all while enjoying our work.\n\nIt’s About Balance\n\n“Work-life balance” isn’t a catch phrase, it’s a core value we live every day. Say goodbye to overtime, long hours, and constant travel. Our culture is built around focusing on what truly matters to you. Whether it’s investing quality time with family, achieving personal fitness goals, dominating your favorite game, or embarking on that dream safari, we support your outside interests.\n\nJoin us and discover a more fulfilling and enjoyable way to work.\n\nResource Data is an Equal Opportunity Employer\n\n",
    "jobId": 3797778984,
    "workplaceType": "Hybrid",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/nathan-crooks",
    "jobPosterName": "Nathan Crooks",
    "companyLogoUrl": "https://media.licdn.com/dms/image/D560BAQHHujyqeySjvw/company-logo_400_400/0/1694017971190/resourcedata_logo?e=1712793600&v=beta&t=CZyXrKnJT9jemZEXmz7l3eNDMMut9N6PEXW5Lhjqdfw",
    "applyUrl": "https://www.linkedin.com/job-apply/3797778984",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 114,
    "viewsCount": 278,
    "companyStaffCount": 250,
    "companyDescription": "Since 1986, Resource Data, Inc. has been dedicated to providing custom IT solutions and IT consulting.\n\nWe provide custom database, application, web, and GIS programming services from offices in Anchorage, Boise, Houston, Portland, and Juneau. Our excellent local reputation has led to the successful completion of projects for hundreds of clients, ranging from small firms to some of the world's largest corporations.\n\nPeople, technology, results: That's what Resource Data was built on, and that's what we're all about.",
    "jobIndustries": "Software Development",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": false,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-10T18:25:22.285Z",
    "query": "https://www.linkedin.com/jobs/view/3797778984/?eBP=CwEAAAGM9JOxYpEOFUmDZWu8xbKUBSzApUGcKxvzyjOL1Gad3IusJESRlcGeSmwJqsxRPTEMhjFesEnqxJwT6I-0bSIXdOTn1NHQRyU2DW2KRwxSQC0QRUcv4Hck-eQeQd9lqlabverpZcOqQmtxkcAVcKe_nU856WnvHO4vmjEMyDKf-UfatgxzkN65USzpcLXwi3EDGhbz0ay5E6gH2lIBQkphjj39tHG74uTeOcfxWR0oZETypV8JoPL0vaPvZmUHYix7lc486i0bALHW7bLd0tNBvkIu62UhOe6nneXSqpYBPiRSKwrzIZvMa4FZ9o7jQocpExiYSvbWvrCF-bgYddF6OKXoahC6yh1fMUyiGgtluHbjQAi5V7oFtED2RoMn3Q&refId=Vm67jnqUZjOTfrqD9QPdFA%3D%3D&trackingId=ZOxAiFsddZsuPjzxyQ2KnA%3D%3D&trk=flagship3_search_srp_jobs#/"
  },
  {
    "jobPosterEmail": "Louisa West",
    "companyUrl": "https://www.linkedin.com/company/bittensor",
    "companyName": "Opentensor Foundation",
    "jobTitle": "Senior Front-end Developer",
    "jobLocation": "United States",
    "postedAt": "2024-01-10T17:35:53.000Z",
    "appliesClosedAt": "2024-07-08T17:35:44.000Z",
    "jobDescription": "Seeking Senior Front-End Developer for Bittensor \nSeeking a Senior Front-End Developer to join our team and transform UI/UX designs into fully functional websites.\nResponsibilities:Translate UI/UX designs into responsive and interactive web applications.Develop and implement front-end architecture to ensure high performance and user engagement.Integrate subscription functionalities into our platform, connecting with fast APIs for optimal performance.Collaborate with cross-functional teams, including backend developers and UI/UX designers, to achieve project goals.\nSkills and Qualifications:Proficient in HTML, CSS, JavaScript, and modern front-end frameworks.Extensive experience in developing and implementing subscription-based systems.Strong understanding of fast API integration for efficient data exchange.Proven track record of delivering high-quality, responsive web applications.Excellent problem-solving skills and ability to work in a collaborative environment.\nWhat We Offer: Competitive salary and benefits package.Opportunity to work on cutting-edge projects with a collaborative team at the forefront of AI.\nLocation: remote",
    "jobId": 3803238094,
    "workplaceType": "Remote",
    "jobPosterProfileUrl": "https://www.linkedin.com/in/louisa-west-70837b263",
    "jobPosterName": "Louisa West",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C4D0BAQECElfoCFuMLA/company-logo_400_400/0/1671286991440/bittensor_logo?e=1712793600&v=beta&t=6iOV5Atpf4dIUjPHCheoeuEAg_onSXiDhj9YGo3CjoQ",
    "applyUrl": "",
    "experienceLevel": "",
    "applicantsCount": 103,
    "viewsCount": 163,
    "companyStaffCount": 23,
    "companyDescription": "Bittensor is a mining network, similar to Bitcoin, that includes built-in incentives designed to encourage miners to contribute compute + knowledge.\n\nToken-based incentives drive the network's growth and distribute the value generated by the network directly to the individuals producing that value, without intermediaries. The network is open to all participants, and no individual or group has full control over what is learned, who can profit from it, or who can access it.\n\nUltimately, our vision is to create a pure market for artificial intelligence, an incentivized arena in which consumers and producers of this valuable commodity can interact in a trustless, open and transparent context.",
    "jobIndustries": "",
    "jobFunctions": "",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-10T18:25:28.485Z",
    "query": "https://www.linkedin.com/jobs/view/3803238094/?eBP=JOB_SEARCH_ORGANIC&refId=Vm67jnqUZjOTfrqD9QPdFA%3D%3D&trackingId=hPTNXIVLaW3%2BvKVRDnKx2Q%3D%3D&trk=flagship3_search_srp_jobs#/"
  },
  {
    "jobPosterEmail": "",
    "companyUrl": "https://www.linkedin.com/company/understanding-recruitment",
    "companyName": "Understanding Recruitment",
    "jobTitle": "Lead Software Engineer",
    "jobLocation": "United States",
    "postedAt": "2024-01-10T17:42:26.000Z",
    "appliesClosedAt": "2024-02-09T17:42:25.000Z",
    "jobDescription": "Are you interested in shaping the world of AI-driven data underwriting? \nI am looking for strong Full Stack Software Engineers (React/Python) to join a world-class engineering team. Their mission is clear: leverage AI to transform commercial insurance by aggregating data from diverse sources.\nThe potential here is limitless, as their innovative product lines require continuous development and frequent launches. This role will have you deploying production code on a daily basis. their application is highly complex, handling documents that can exceed 100 pages. The primary challenge is ensuring an intuitive user interface despite this complexity.\n🔥 Why Them?They're trailblazers in this field, committed to reshaping underwriting. With over $40m in funding and strong recurring revenue they are looking for engineers to expand their complex data-intensive UI & contribute to the back end infrastructure.\n🛠️ Tech Stack & Requirements:6+ YOE as a software engineerFront End: React.js & TypeScriptBack End: PythonBSc Computer Science, Mathematics or a related field.The interview process will be in the above languages so please only apply if you have professional experience in these languages.\n🌎 Fully Remote across the US:The role offers full remote flexibility for those based in the US.",
    "jobId": 3802607181,
    "workplaceType": "Remote",
    "jobPosterProfileUrl": "",
    "jobPosterName": "",
    "companyLogoUrl": "https://media.licdn.com/dms/image/C4D0BAQEi98b-tf2v4w/company-logo_400_400/0/1663686754374/understanding_recruitment_logo?e=1712793600&v=beta&t=jc6v37XxcId7_psQn2S5UvIVMaXFBzBY4mZi6vRIv78",
    "applyUrl": "",
    "experienceLevel": "Mid-Senior level",
    "applicantsCount": 33,
    "viewsCount": 138,
    "companyStaffCount": 102,
    "companyDescription": "Understanding Recruitment is an award-winning technology, software and digital recruitment consultancy with headquarters in St. Albans, Hertfordshire.  \n\nWe also have a US office in Boston, Massachusetts specialising in working closely with highly skilled individuals seeking their next career move within Next Gen Tech, Backend Engineering, and Artificial Intelligence.  \n\nWe recently celebrated our first decade in business and over the years have been recognised with several industry awards including 'Best Staffing Firm to Work For 2018'​ at the SIA Awards for the third consecutive year and ‘Business of the Year 2017’ at the SME Hertfordshire Business Awards. \n\nOur teams of specialists operate across all areas of Technology and Digital, including Java, JavaScript, Python, .Net, DevOps & SRE, SDET, Artificial Intelligence, Machine Learning, AI, Digital, Quantum Computing, Hardware Acceleration, Digital, Charity, Fintech, and the Public Sector. ",
    "jobIndustries": "Software Development, IT Services and IT Consulting, Insurance",
    "jobFunctions": "Engineering, Information Technology",
    "remoteAllowed": true,
    "jobState": "LISTED",
    "jobType": "Full-time",
    "timestamp": "2024-01-10T18:25:34.618Z",
    "query": "https://www.linkedin.com/jobs/view/3802607181/?eBP=JOB_SEARCH_ORGANIC&refId=Vm67jnqUZjOTfrqD9QPdFA%3D%3D&trackingId=KZ2wiJw24Bx713H%2Bhyopsg%3D%3D&trk=flagship3_search_srp_jobs"
  }
]
